[
    {
        "sessionspeakers": "Eric Steegmans",
        "fulllink": "http://www.devoxx.com/display/DV09/Introduction+to+Java+Generics",
        "room": "8",
        "tags": "Java",
        "track": "University",
        "unixstart": "1258363800",
        "sessiontitle": "Introduction to Java Generics",
        "datetime": "9:30-12:30",
        "unixend": "1258374600",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Since version 5, Java supports the definition of generic classes and generic interfaces. Even before their final release, the new language constructs were praised by some and criticized by others. In this talk, we start with a short overview of the basic concepts for defining and instantiating generic classes in Java. We then discuss \"type erasure\" as a technique to ensure backward compatibility. At the same time, we pinpoint potential dangers of that approach. In the second part of the talk the focus is on inheritance. We start this with a short overview of wild cards in specifying generic arguments, and discuss their pros and cons. We then discuss problems that arise in developing hierarchies of generic classes and interfaces. We finish the talk with a look at concepts supporting the definition of generic methods.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Introduction+to+Java+Generics"
    },
    {
        "sessionspeakers": "John M Willis",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Cambrian+Cloud+Computing+Explosion",
        "room": "5",
        "tags": "Cloud",
        "track": "University",
        "unixstart": "1258363800",
        "sessiontitle": "The Cambrian Cloud Computing Explosion",
        "datetime": "9:30-12:30",
        "unixend": "1258374600",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "A complete survey of cloud computing starting with early IBM ideas, traveling through Google's implementation, Amazon's Web Services; continuing with the state of the industry as it stands in late 2009. \nWe will also provide some insights and predictions for 2010, 2011, and beyond. This presentation cover the complete state of cloud computing and be useful for anyone working or planning to work in IT.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Cambrian+Cloud+Computing+Explosion"
    },
    {
        "sessionspeakers": "Joram Barrez, Tom Baeyens",
        "fulllink": "http://www.devoxx.com/display/DV09/jBPM4++in+Action",
        "room": "4",
        "tags": "BPM",
        "track": "University",
        "unixstart": "1258363800",
        "sessiontitle": "jBPM4 in Action",
        "datetime": "9:30-12:30",
        "unixend": "1258374600",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "jBPM is the leading open source BPM and workflow engine. The business values of BPM are well known, but jBPM is unique in offering value in a way that developers just love it. jBPM is built upon the Process Virtual Machine, which enables support for multiple process languages like jPDL and BPMN. In this talk, we'll dive deeply in the core of jBPM, demonstrating the new API, the revised XML presentationand much, much more. We'll demonstrate all these features by showing how to build a high-performant, scalable train ticket handling platform based on jBPM. We'll look into how jBPM can be embedded into your application and how it can enrich your domain model. In short: if you have the slightest interest in jBPM or BPM, then this talk simply cannot be missed!",
        "sessionlink": "http://www.devoxx.com/display/DV09/jBPM4++in+Action"
    },
    {
        "sessionspeakers": "Olav Maassen",
        "fulllink": "http://www.devoxx.com/display/DV09/Kanban+in+Action",
        "room": "9",
        "tags": "Methodology",
        "track": "University",
        "unixstart": "1258363800",
        "sessiontitle": "Kanban in Action",
        "datetime": "9:30-12:30",
        "unixend": "1258374600",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Kanban is one of the newer agile methodologies. This session introduces Kanban, explains what it is, how it works and how it can be applied to software development. \nKanban acts to limit work-in-progress and focus the team on achieving a continuous flow of value to the customer. Kanban innovates on accepted agile management practice by providing an iteration-less process with a regular release cadence. It helps achieve a balance of demand against capacity on the team and eliminate multi-tasking. \nAlthough loosely based on Toyota Production System, the Kanban software development community has taken the underlying principles of TPS and used them to achieve a similar results in software development. \nKanban teams value: Quality, limited work-in-progress, balance capacity against demand and prioritization. \nIn this session we'll discuss Kanban, its values, flow, cadence, theory of constraints, bottlenecks and of course how to apply these in real projects.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Kanban+in+Action"
    },
    {
        "sessionspeakers": "Chet Haase, Christophe Coenraets",
        "fulllink": "http://www.devoxx.com/display/DV09/Adobe+University",
        "room": "8",
        "tags": "RIA",
        "track": "University",
        "unixstart": "1258378200",
        "sessiontitle": "Adobe University",
        "datetime": "13:30-16:30",
        "unixend": "1258389000",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "It's an exciting time for Adobe. The Adobe Flash player has never known a faster adoption rate, with more than 80% of all online videos playing on top of the Flash player. Rich internet applications (RIAs) are commonplace, and common sense, and the Adobe AIR platform is doing well as a standalone RIA deployment platform. \nBut there are still many exciting things to come: Flash player 10 on mobile devices, improved designer/developer workflows, more online services, better tools, richer media, more flexible and powerful RIA development tools and platforms, and much more. \nJoin us in this university session for a full overview of the Flash platform, including topics like new tools technologies, new developments in Flex and the Flash platform, and the Open Screen project. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Adobe+University"
    },
    {
        "sessionspeakers": "Chris Richardson",
        "fulllink": "http://www.devoxx.com/display/DV09/Architecting+Robust+Applications+for+Amazon+EC2",
        "room": "5",
        "tags": "Cloud",
        "track": "University",
        "unixstart": "1258378200",
        "sessiontitle": "Architecting Robust Applications for Amazon EC2",
        "datetime": "13:30-16:30",
        "unixend": "1258389000",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "The Amazon Elastic Compute Cloud (EC2) is a virtualized computing environment where you rapidly provision and manage servers via a web services API. It is ideally suited to running Java applications because it allows you to develop applications using standard software packages such as Tomcat and MySQL. However, because it is a cloud, some aspects of EC2 are very different than a traditional, physical computing environment, which impacts how you handle security, networking, storage and availability. In addition, Amazon provides several extremely useful web services. These include the Simple Storage Service (S3), Simple Queuing Service (SQS) and Simple DB. By using these scalable services in your application, you can reduce the complexity and cost developing and deploying your application.\n\nIn this session, which is aimed at senior Java developers and architects, you will learn:\n- How to use EC2 and the other Amazon web services to develop and deploy Java EE applications\n- How to significantly simplify common administrative tasks such as upgrades\n- How to design highly available applications with EC2 availability zones\n- How to architect secure applications for Amazon EC2\n- How to store and deliver content with S3 and Cloud Front\n- How to store data in SimpleDB\n- How to build loosely coupled systems with SQS",
        "sessionlink": "http://www.devoxx.com/display/DV09/Architecting+Robust+Applications+for+Amazon+EC2"
    },
    {
        "sessionspeakers": "Andy Schwartz, Peter Muir, Dan Allen",
        "fulllink": "http://www.devoxx.com/display/DV09/JSF+2+and+beyond",
        "room": "4",
        "tags": "Enterprise Java",
        "track": "University",
        "unixstart": "1258378200",
        "sessiontitle": "JSF 2 and beyond",
        "datetime": "13:30-16:30",
        "unixend": "1258389000",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "The JSF 2.0 specification (JSR-314) addresses a substantial number of long standing pain points that JSF users have just come to accept as a hard knock life (or death by 1000 paper cuts). At last, JSF is a true contender amongst web frameworks. Now that the specification is final, it's time to take a step back and evaluate the results and also look ahead to JSF 2.1.\n\nThis presentation will provide an in-depth introduction to many of the new JSF 2.0 features and will ask of each: Is the currently specified solution sufficient? We'll also consider whether other concerns have been overlooked.\nHere's a partial list of the features we'll be covering:\n- State saving: We'll introduce the new partial state saving solution in JSF 2.0 and consider whether additional utilities are needed for strictly stateless use cases.\n- GET support: At long last, JSF now supports GET request processing in the form of bookmarkable URLs and request parameter binding. But how does it measure up to frameworks that accept REST-style URLs?\n- Validation: Integration with JSR-303: Bean Validation changes the data validation landscape. We'll examine how far it stretches and whether it can handle that elusive multi-component validation use case.\n- Ajax: JSF 2.0 finally delivers Ajax support! We'll survey this new functionality and consider just how far it goes to allowing developers to forget about the tedium of JavaScript, and how well it accommodates custom JavaScript when it's warranted.\n- Facelets: The marriage between JSF and JSP was never a good one. Facelets stood in as the surrogate view handler for JSF and arguably saved the framework. Now it's part of the specification and also got it's long overdue update. But is there still room for this templating solution to improve?\n\nWhile this presentation covers many new features of the JSF 2.0 specification, the underlying goal of this session is to serve as an outreach to identify outstanding recommendations for making the framework more pleasant and productive to use and to give members of the JSF community the invitation to participate in the improvement of the JSF platform. As such, attendees are encouraged to bring their own concerns and suggestions to the table.\n\nWhether you are a new JSF user who wants to find out more about the latest developments in the specification or an old hat with an issue or two on your mind, this session has something to offer you!",
        "sessionlink": "http://www.devoxx.com/display/DV09/JSF+2+and+beyond"
    },
    {
        "sessionspeakers": "Sang Shin",
        "fulllink": "http://www.devoxx.com/display/DV09/SOA%2C+OpenESB+and+OpenSSO+Programming+with+Passion",
        "room": "9",
        "tags": "SOA",
        "track": "University",
        "unixstart": "1258378200",
        "sessiontitle": "SOA, OpenESB and OpenSSO Programming with Passion",
        "datetime": "13:30-16:30",
        "unixend": "1258389000",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "Service Oriented Architecture (SOA) represents a fundamental shift in the way applications are built, deployed, and used (or reused). By moving from big, monolithic applications to smaller, re-usable service blocks, companies can dramatically reduce time-to-market, increase maintainability and flexibility over the applications they build.\n\nThis session starts with a brief discussion on the concept of SOA application. The majority of the session is devoted to explaining and demonstrating several concrete technologies that make SOA architecture possible - BPEL (Business Process Execution Language), JBI (Java Business Integration), and OpenESB. Several popular OpenESB modules are then introduced, and they include Intelligent Event Processing (IEP), Master Data Management (MDM), Work List Manager (WLM), etc. The last hour of the session will be devoted to discussing Identity management and Single Sign On based on OpenSSO technology.\n\nThis session is based on the free online course of the same topic, whose contents are available from www.javapassion.com/soaprogramming. Attendees are welcome to bring their laptops along with the hands-on labs posted on the course website.",
        "sessionlink": "http://www.devoxx.com/display/DV09/SOA%2C+OpenESB+and+OpenSSO+Programming+with+Passion"
    },
    {
        "sessionspeakers": "Chet Haase",
        "fulllink": "http://www.devoxx.com/display/DV09/Adobe+Flash+Catalyst",
        "room": "8",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258389900",
        "sessiontitle": "Design to Development part 1: Adobe Flash Catalyst",
        "datetime": "16:45-17:15",
        "unixend": "1258391700",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "Learn how using Flash Catalyst and Flash Builder 4 together enables designers and developers to work jointly to create high-fidelity Rich Internet Applications. In this first part, we take a look at the designer's role in this workflow. We will use a design file authored in Adobe Illustrator as the starting point for our application UI and will work in Flash Catalyst to convert design elements into functional UI components, states, and navigational elements. After the interaction design is finished, the project is give to the developer to add application functionality, which we will see in Part 2. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Adobe+Flash+Catalyst"
    },
    {
        "sessionspeakers": "Dan Haywood",
        "fulllink": "http://www.devoxx.com/display/DV09/Introducing+Scimpi",
        "room": "5",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258389900",
        "sessiontitle": "Introducing Scimpi",
        "datetime": "16:45-17:15",
        "unixend": "1258391700",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "Scimpi is an extensible web viewer that builds upon the capabilities of the Naked Objects framework. Whereas the viewers that ship with Naked Objects always provide a default view of the domain objects, Scimpi does all this too but then lets the developer modify the view as required using a selection of powerful taglibs.\n\nThe end result is a development environment that rivals (exceeds?) the productivity of Rails coupled with the familiarity and robustness of the Java platform. Moreover, your domain model need not be deployed only to the web; Naked Objects also supports other viewers (including RESTful viewers) and client/server remoting, as well as Fitnesse-based testing capabiliities.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Introducing+Scimpi"
    },
    {
        "sessionspeakers": "Oliver Gierke",
        "fulllink": "http://www.devoxx.com/display/DV09/Easing+JPA+data+access+with+Hades",
        "room": "4",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258389900",
        "sessiontitle": "Easing JPA data access with Hades",
        "datetime": "16:45-17:15",
        "unixend": "1258391700",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "The talk introduces the OpenSource library Hades that significantly eases implementing data access layers with JPA. Thus it will take the audience on a guided tour through code samples introducing the features of Hades:\n- Executing queries by only declaring interface methods\n- Extending the EntityManager to provide a typed interface, programmatic pagination and sort support\n- Combining execution of finder methods with pagination\n- Auditing of entities to keep track of creation and modification date and user\n- Integration of custom data access code\n- Integration into Spring applications via Spring namespace and Spring IDE extension",
        "sessionlink": "http://www.devoxx.com/display/DV09/Easing+JPA+data+access+with+Hades"
    },
    {
        "sessionspeakers": "Jaroslaw Jantura, Patrycja Wegrzynowicz",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Jungle+of+the+Web+-+A+Way+to+Survive+by+Detecting+Fast+Flux+Botnets",
        "room": "9",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258389900",
        "sessiontitle": "The Jungle of the Web - A Way to Survive by Detecting Fast Flux Botnets",
        "datetime": "16:45-17:15",
        "unixend": "1258391700",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "The World Wide Web exceeded a number of one trillion pages in 2008. It is considered that one in ten pages contains malware like computer viruses, worms, trojan horses, spyware, crimeware, or other malicious software. This way the WWW became the biggest scene of crime ever observed.\n\nThe development of the World Wide Web is an evolution. The cybercrimes have been becoming more diverse and sophisticated. But also the methods to protect against them have gone a long way since the beginning of the WWW. This arm race is experiencing a rapid growth and there still are many things to do, especially on the bright side.\n\nThis talk goes through the various types of malware and the different methods to spread it together with the state-of-the-art detection approaches. Our focus is on a DNS technique called fast flux. This technique is used by botnets to hide phising and malware delivery sites. We present an algorithm and a Java tool to detect the fast flux domains. The tool has been developed in the course of the HoneySpider Network project. This project aims in developing a complete client honeypot system with the primary focus on attacks against, or involving the use of, Web browsers. The fast flux detector tool is provided as a standalone application as well as a Firefox plugin. There are more plugins to be released this year that will help to identify malicious web sites. These include an ICAP client and a web page analyser that uses the static and dynamic analysis techniques to discover malicious software. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Jungle+of+the+Web+-+A+Way+to+Survive+by+Detecting+Fast+Flux+Botnets"
    },
    {
        "sessionspeakers": "Christophe Coenraets",
        "fulllink": "http://www.devoxx.com/display/DV09/Adobe+Flash+Builder",
        "room": "8",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258392300",
        "sessiontitle": "Design to Development part 2: Adobe Flash Builder",
        "datetime": "17:25-17:55",
        "unixend": "1258394100",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "Learn how using Flash Catalyst and Flash Builder 4 together enables designers and developers to work jointly to create high-fidelity Rich Internet Applications. In this session, we use Flash Builder, starting from a project file built in Flash Catalyst and creating a finished Flex application. We enhance the application functionality by adding code in Flash Builder, as well as Flash Builder's data services feature to retrieve and display dynamic data. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Adobe+Flash+Builder"
    },
    {
        "sessionspeakers": "Noora Peura, Anders Astrand",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Next+Generation+Profiling+and+Diagnostics+Tools",
        "room": "5",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258392300",
        "sessiontitle": "The Next Generation Profiling and Diagnostics Tools",
        "datetime": "17:25-17:55",
        "unixend": "1258394100",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "Over the last few years JRockit Mission Control has successfully been used to solve problems ranging from finding computationally bound bottle necks to pin-pointing latency related problems in production systems. During this time Mission Control has evolved a lot, but one of the overarching design goals has always remained - to be able to do what it does with remarkably low overhead. This low-overhead design has enabled us to take a bold step forward in the upcoming version of JRockit Mission Control.\n\nThe latest version of JRockit Mission Control is a very potent suite of Java tools for monitoring, managing, profiling, finding latency related problems and hunting for memory leaks in Java applications. This talk will start with a quick re-cap of the major JRockit Mission Control tools, then quickly move on to discuss some exciting features available in the most recently available version of JRockit Mission Control. Most of the talk will be spent on features that will be released quite soon in the upcoming new major release of JRockit Mission Control.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Next+Generation+Profiling+and+Diagnostics+Tools"
    },
    {
        "sessionspeakers": "Evert Arckens, Steven Noels",
        "fulllink": "http://www.devoxx.com/display/DV09/NoSQL+with+Cassandra+and+Hadoop",
        "room": "4",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258392300",
        "sessiontitle": "NoSQL with Cassandra and Hadoop",
        "datetime": "17:25-17:55",
        "unixend": "1258394100",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "As the amount and pace of data-generation keeps growing, businesses are stepping away from traditional rdbms solutions and go for highly scalable store solutions. Numerous papers are being published on this topic for instance by well known companies like Google, Facebook and Amazon and opensource projects come into existence like Cassandra and Hadoop. In this BOF we want to give an overview on these emerging technologies and discuss what they could mean for your business applications. We would also like to gather experience reports from people using for instance Cassandra.",
        "sessionlink": "http://www.devoxx.com/display/DV09/NoSQL+with+Cassandra+and+Hadoop"
    },
    {
        "sessionspeakers": "Peter Niederwieser",
        "fulllink": "http://www.devoxx.com/display/DV09/Spock+-+the+smarter+testing+and+specification+framework",
        "room": "9",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258392300",
        "sessiontitle": "Spock - the smarter testing and specification framework",
        "datetime": "17:25-17:55",
        "unixend": "1258394100",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "This presentation will introduce Spock, a young but aspiring testing and specification framework for the JVM. We will start out by showing Spock's beautiful and highly expressive specification language. Built on top of Groovy, it removes the need for assertion APIs, record-and-replay mocking APIs, and other unnecessary distractions. What remains is a succinct description of a program's desired behavior. Leaving theory behind us, we will have fun with Spock in action by writing and running specifications in different environments. Along the way, we will discuss how Spock compares to well-known testing tools like JUnit and EasyMock. Many of Spock's features are implemented by hooking into the Groovy compiler and rewriting specifications at compile-time. Fortunately, this is completely transparent to users and execution environments. Nevertheless, we will reveal some of the dirty little secrets. Towards the end of the presentation, we will present our vision for Spock's future, and show how you can get involved.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Spock+-+the+smarter+testing+and+specification+framework"
    },
    {
        "sessionspeakers": "Tom Baeyens, Joram Barrez",
        "fulllink": "http://www.devoxx.com/display/DV09/Meet+the+jBPM+Team",
        "room": "1",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258398000",
        "sessiontitle": "Meet the jBPM Team",
        "datetime": "19:00-20:00",
        "unixend": "1258401600",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "Informal get together with the jBPM team.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Meet+the+jBPM+Team"
    },
    {
        "sessionspeakers": "Evert Arckens, Steven Noels",
        "fulllink": "http://www.devoxx.com/display/DV09/NoSQL+with+Cassandra+and+Hadoop",
        "room": "2",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258398000",
        "sessiontitle": "NoSQL with Cassandra and Hadoop",
        "datetime": "19:00-20:00",
        "unixend": "1258401600",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "As the amount and pace of data-generation keeps growing, businesses are stepping away from traditional rdbms solutions and go for highly scalable store solutions. Numerous papers are being published on this topic for instance by well known companies like Google, Facebook and Amazon and opensource projects come into existence like Cassandra and Hadoop. In this BOF we want to give an overview on these emerging technologies and discuss what they could mean for your business applications. We would also like to gather experience reports from people using for instance Cassandra.",
        "sessionlink": "http://www.devoxx.com/display/DV09/NoSQL+with+Cassandra+and+Hadoop"
    },
    {
        "sessionspeakers": "Geoffrey De Smet",
        "fulllink": "http://www.devoxx.com/display/DV09/Examination+timetabling+with+Drools+Solver",
        "room": "1",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258401600",
        "sessiontitle": "Examination timetabling with Drools Solver",
        "datetime": "20:00-21:00",
        "unixend": "1258405200",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Drools Solver solves planning problems. In this session, we'll take a look at the use case of examination timetabling: We will automatically assign exams to periods and rooms, while respecting the physical resources and while make the enrolled students as happy as possible.\n\nFirst, we 'll see how we can easily define a scalable score function by using the drools rule engine with little or no impact on our (JPA annotated?) domain classes. Constraints such as these become maintainable and readable:\n\nThe hard constraints have to be fulfilled:\n- No student can attend 2 exams in the same period.\n- No exam can take longer than the period's duration.\n- No room must exceed it's available seating.\n\nThe soft constraints should be fulfilled as much as possible (according to their weight):\n- Students don't like to attend 2 exams in the same day.\n- It is distracting to have exams of different durations in the same room in the same period.\n- Students don't like large exams near the end of the schedule.Secondly, we'll investigate how we can find a good solution for real world data sets. Even a small university's schedule with 934 exams, 36 periods and 48 rooms has an astonishing 10^5000 possible solutions. We'll use different Drools Solver algorithms such as its tabu search and come up with feasible solutions in mere minutes.\n\nThis use case is defined by the International Timetabling Competition 2007. It uses large data sets from real-world institutions. Geoffrey, lead developer of Drools Solver, participated in the competition with an early, untweaked version of his Drools Solver and finished 4th. Much has been improved meanwhile. The complete example (as well as several others) is available for download from the Drools website.\n\nFor more information about Drools Solver, take a look a the Drools team blog or the Drools Solver reference manual.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Examination+timetabling+with+Drools+Solver"
    },
    {
        "sessionspeakers": "Andy Schwartz, Roger Kitain, Peter Muir, Dan Allen",
        "fulllink": "http://www.devoxx.com/display/DV09/JSF2+and+Beyond",
        "room": "2",
        "tags": "JavaEE",
        "track": "BOFs",
        "unixstart": "1258401600",
        "sessiontitle": "JSF2 and Beyond",
        "datetime": "20:00-21:00",
        "unixend": "1258405200",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Meet the JSF2 spec. leads and discuss (near) future JSF features",
        "sessionlink": "http://www.devoxx.com/display/DV09/JSF2+and+Beyond"
    },
    {
        "sessionspeakers": "Kees Jan Koster",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+Tuning+Puzzlers",
        "room": "1",
        "tags": "JavaSE",
        "track": "BOFs",
        "unixstart": "1258405200",
        "sessiontitle": "Java Tuning Puzzlers",
        "datetime": "21:00-22:00",
        "unixend": "1258408800",
        "sessiontime": "21:00-22:00",
        "sessionabstract": " In this BOF we will look at some strange and bizarre exceptions, error messages and performance measurements. We'll discuss each of them and try to resolve them together.\n\nAlso attend Tools in Action talk on A Year of Monitoring with Java-monitor.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+Tuning+Puzzlers"
    },
    {
        "sessionspeakers": "Emmanuel Bernard",
        "fulllink": "http://www.devoxx.com/display/DV09/Hibernate+BOF",
        "room": "2",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258405200",
        "sessiontitle": "Hibernate BOF",
        "datetime": "21:00-22:00",
        "unixend": "1258408800",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "Get the latest news from the Hibernate team on everything Hibernate: \n- Java Persistence 2 and how Hibernate implements it\n- Hibernate Validator 4 the Bean Validation reference implementation\n- Hibernate Search, the full-text search solution for Hibernate applications\n- tools\n\nAnd of course, it's a BoF, so bring your questions and remarks with you and let's discuss everything persistence\n\nAlso attend Hibernate Search university",
        "sessionlink": "http://www.devoxx.com/display/DV09/Hibernate+BOF"
    },
    {
        "sessionspeakers": "Alexis Moussine-Pouchkine, Antonio Goncalves",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Java+EE+6++Platform",
        "room": "8",
        "tags": "Java Enterprise",
        "track": "University",
        "unixstart": "1258450200",
        "sessiontitle": "The Java EE 6 Platform",
        "datetime": "9:30-12:30",
        "unixend": "1258461000",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Take a deep breath at Java EE 6. In this session, Antonio Goncalves will present the just released Java EE 6 plateform with slides, showing you code, and demoing a Java EE 6 application using open-source implementations. Antonio will show you some novelties of the plateform : new EJBs, simplified packaging, an enriched persistence layer, a new API for RESTful services, a validation framework, a radical simplification of the web layer and ... many other improvements that make Java EE 6 ideal for your applications. Java EE 6 applications combine standards and robustness. Come to this university talk and check it out by yourself.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Java+EE+6++Platform"
    },
    {
        "sessionspeakers": "Scott Stevenson, Sam Brodkin",
        "fulllink": "http://www.devoxx.com/display/DV09/Google+App+Engine+for+Java+-+a+real+live+voyage+to+The+Cloud",
        "room": "5",
        "tags": "Cloud",
        "track": "University",
        "unixstart": "1258450200",
        "sessiontitle": "Google App Engine for Java - a real live voyage to The Cloud",
        "datetime": "9:30-12:30",
        "unixend": "1258461000",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Starting a greenfield project is your chance to give the latest, most hyped technologies a spin. What would you choose? Spring 3, GWT, JSF, maybe a dynamic language? Of course you'd want to get your development environment setup like a well-oiled machine - complete with testing, continuous integration, IDE support, and a shiny Maven or Ant build. Unfortunately, you'll also have to pull out that old dusty copy of Linux for Dummies to setup your development and production servers. Or will you?\n\nJust for this talk, I'm developing a new, non-trivial application called \"swagswap\" on Google App Engine for Java. It's an app to categorize, rate, and trade swag (conference goodies). As we stroll through the code you'll experience the exhilaration of appengine development. I'll talk about the the pleasures, convenience, and the overall giddiness you feel when developing on this platform. With that come the pitfalls, limitations, and forced choices I had to either overcome or swallow whole.\n\nThe swagswap app will be live during the conference and will give vendors feedback on the quality of their swag. I will also publish performance statics so we can see how well appengine performs under the load of the swarms of Devoxx attendees.\n\nCheck out the source code at http://code.google.com/p/swagswap/ \n\ncategorize, rate, and trade conference swag at http://swagswap.appspot.com/",
        "sessionlink": "http://www.devoxx.com/display/DV09/Google+App+Engine+for+Java+-+a+real+live+voyage+to+The+Cloud"
    },
    {
        "sessionspeakers": "Erik Hatcher",
        "fulllink": "http://www.devoxx.com/display/DV09/Solr+Power+with+Lucene",
        "room": "4",
        "tags": "Java",
        "track": "University",
        "unixstart": "1258450200",
        "sessiontitle": "Solr Power with Lucene",
        "datetime": "9:30-12:30",
        "unixend": "1258461000",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Solr powers the search of many enterprise applications, and long before Solr shone on enterprise search, Lucene - Solr's core library, was and still is used to drive the search of applications pervasively around the world. In this university lecture we'll cover the typical workflow of getting data into Solr, configuring Solr's indexing and search processes, and building a searching client user interface. Common indexing options will be explored: database (JDBC) indexing, RSS/Atom and other XML data sources, CSV formatted data, rich text (Word, PDF, HTML, etc) documents and indexing through Solr's various native language APIs. Solr's configurability and usage options discussion will include query parsing, faceting, relevancy ranking, spell checking, highlighting, clustering and more-like-this.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Solr+Power+with+Lucene"
    },
    {
        "sessionspeakers": "Martijn Dashorst",
        "fulllink": "http://www.devoxx.com/display/DV09/Introducing+Apache+Wicket",
        "room": "9",
        "tags": "Web",
        "track": "University",
        "unixstart": "1258450200",
        "sessiontitle": "Introducing Apache Wicket",
        "datetime": "9:30-12:30",
        "unixend": "1258461000",
        "sessiontime": "9:30-12:30",
        "sessionabstract": "Learn how to use Apache Wicket to create web applications on your own from the masters. This hands-on lab will provide a quick introduction to the Wicket framework and we'll start with coding right away. At the basis for this course lies the Wicket in Action book, written by the course leader. We'll start with setting up our project, move on from a simple hello world application to implementing an online cheese store. \n\nWe'll learn to connect it to services delivered by Spring and a back end served with a JPA provider (Hibernate or OpenJPA). During this course we'll cover the end-to-end basics of web application development: unit testing, writing maintainable code, internationalization, security and deployment.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Introducing+Apache+Wicket"
    },
    {
        "sessionspeakers": "Stephen Chin",
        "fulllink": "http://www.devoxx.com/display/DV09/The+JavaFX+Platform+-+A+Java+Developer%27s+Guide",
        "room": "8",
        "tags": "RIA",
        "track": "University",
        "unixstart": "1258464600",
        "sessiontitle": "The JavaFX Platform - A Java Developer's Guide",
        "datetime": "13:30-16:30",
        "unixend": "1258475400",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "JavaFX is the future of RIA development. It takes the power of a modern scene graph, adds rich animation and multimedia capabilities, and extends to the web and beyond with seamless portability. At the same time, it leverages the power and breadth of the Java platform, allowing full access to existing Java libraries and integration with Java client technologies.\n\nThis session will introduce you to the JavaFX language and platform from the perspective of a seasoned Java developer. This will start with a quick language tour focused on the differences between Java and JavaFX, and pointing out specific benefits of the JavaFX Script language for UI development. The breadth of JavaFX APIs will be explained through several examples that we will build out during the course of the session.\n\nI will also cover third-party, open-source libraries with a focus on technologies that make it possible to write full enterprise applications. This includes web service integration and UI control libraries that will get you writing professional JavaFX applications today. Finally, I will show how JavaFX applications can be deployed as desktop widgets with all the security guarantees of the Java platform.\n\nIf you have heard about JavaFX, but were not sure about taking the plunge, then this is the presentation for you.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+JavaFX+Platform+-+A+Java+Developer%27s+Guide"
    },
    {
        "sessionspeakers": "Nicolai Josuttis",
        "fulllink": "http://www.devoxx.com/display/DV09/SOA+in+Practice",
        "room": "5",
        "tags": "SOA",
        "track": "University",
        "unixstart": "1258464600",
        "sessiontitle": "SOA in Practice",
        "datetime": "13:30-16:30",
        "unixend": "1258475400",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "The 21st century is the century of globalization. This also applies to IT. More and more system development is only a task in the broader approach of system landscape maintenance.\n\nHere, SOA comes into play. To realize business processes over distributed systems you need concepts that deal with globalization. You might have heard about loose coupling, high interoperability, and service-orientation as key elements of SOA. But the real power SOA comes from dealing with the fact that systems landscapes are heterogeneous and have different owners (which means that it's far more than just applying Web-Services or discussing whether REST is the better approach).\n\nBased on his experience of bringing SOA in operation at major world-wide companies Nicolai Josuttis will explain what SOA really is and why its concepts are so important for the next decades.",
        "sessionlink": "http://www.devoxx.com/display/DV09/SOA+in+Practice"
    },
    {
        "sessionspeakers": "Emmanuel Bernard",
        "fulllink": "http://www.devoxx.com/display/DV09/Hibernate+Search+university",
        "room": "4",
        "tags": "Java Enterprise",
        "track": "University",
        "unixstart": "1258464600",
        "sessiontitle": "Hibernate Search university",
        "datetime": "13:30-16:30",
        "unixend": "1258475400",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "Search has become a fundamental tool not only for Web applications but also for internal and rich applications. Data should be found efficiently and fast. Solving this problem encompass both technical and user interaction design decisions. Plain old SQL search has reached its limits in a world where users are accustomed to full-text search.\n\nThis presentation will demonstrate a practical approach to expose your data via full-text search using Hibernate Search and Lucene. This demonstration will show you how the tools has been designed for simplicity and freedom and how it feels natural to an Hibernate user.\n\nWe will cover:\n- what full-text search brings that plain SQL does not\n- the key benefits and the architecture of Hibernate Search\n- how to migrate an existing Hibernate application to use Hibernate Search\n- how to use some of the most powerful full-text features like ngram and phonetic approximation\n- various Hibernate Search scalability and clustering configurations\n\nNo prerequisite knowledge of Hibernate Search is needed.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Hibernate+Search+university"
    },
    {
        "sessionspeakers": "Matt Casters",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+Business+Intelligence+with+Pentaho",
        "room": "9",
        "tags": "Enterprise",
        "track": "University",
        "unixstart": "1258464600",
        "sessiontitle": "Java Business Intelligence with Pentaho",
        "datetime": "13:30-16:30",
        "unixend": "1258475400",
        "sessiontime": "13:30-16:30",
        "sessionabstract": "Overview of the Pentaho Open Source BI Stack.\n- Introduction to Pentaho : project & company\n- The Pentaho BI Platform overview\n- Pentaho Analyses (OLAP) a.k.a Mondrian.\n- Pentaho Reporting a.k.a JFreeReport\n- Pentaho Data Integration (ETL) a.k.a. Kettle\n- Pentaho Data Mining a.k.a. Weka\n- Pentaho Metadata\n- Recap, useful links, etc.\n- Q&A",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+Business+Intelligence+with+Pentaho"
    },
    {
        "sessionspeakers": "Frederic Simon, Yoav Landman",
        "fulllink": "http://www.devoxx.com/display/DV09/Advanced+Artifacts+Management+with+Artifactory",
        "room": "8",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258476300",
        "sessiontitle": "Advanced Artifacts Management with Artifactory",
        "datetime": "16:45-17:15",
        "unixend": "1258478100",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "Artifactory is an enterprise Repository Manager for your Maven and other binary artifacts, now available in both Open Source and Cloud-based versions.\n\nIn this demo-centric session, we present new methods for managing your build artifacts and third-party dependencies using Artifactory's unique features.\n\nBy attaching metadata to your artifacts and artifact containers (e.g.:version folders), we show you how to open up unlimited possibilities for managing and controlling the artifacts you use in your daily work, including: promotion and demotion, staging, licensing, assigning quality metrics, using ratings, and so on.\n\nWe also demonstrate a complete, holistic approach toward artifacts management by integrating your artifacts repository manager with your CI server, we will show how your build can be automatically linked to the artifacts it produced and to the dependencies used.\n\nFinally,this session briefly covers some of the commercially available add-ons that can be installed on top of the OSS Artifactory version to enable:\n\nSmart searches:for collecting and manipulating \"shopping carts\" of artifacts\n\nUser-defined property sets of structured properties: to create UIs for tagging and searching of artifacts\n\nFocused artifact watches and events\n\nAutomatic jar signing and WebStart/JavaFx deployment\n\nIntegration with existing enterprise SSO solutions",
        "sessionlink": "http://www.devoxx.com/display/DV09/Advanced+Artifacts+Management+with+Artifactory"
    },
    {
        "sessionspeakers": "Hans Dockter",
        "fulllink": "http://www.devoxx.com/display/DV09/Gradle+-+A+Better+Way+To+Build",
        "room": "5",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258476300",
        "sessiontitle": "Gradle - A Better Way To Build",
        "datetime": "16:45-17:15",
        "unixend": "1258478100",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "Gradle is a powerful build system that is driven by a Groovy DSL. In this presentation we will give a brief introduction to Gradle and then focus on Gradle's smart execution features. Specially for large enterprise builds, the build performance is critical. Yet the build must be reliable and should be intuitive to use. Gradle offers plenty of features to support this: Gradle keeps a history of past build executions, provides ready to use and performant tools for change detection. You will learn about the unique Gradle incremental compile with a state-of-the-art dependency analysis. We will show Gradle's multi-threaded test execution and the advantages of a fully customizable fork frequency. You will also learn about Gradle's smart skipping and the many ways how you can control the execution of a multi-project build and optimize it for certain use cases. All this is provided out-of-the-box for standard Java project's. Yet Gradle provides all this not via a rigid framework but by a rich domain model. That way all those features a part of an extremely customizable, true build language.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Gradle+-+A+Better+Way+To+Build"
    },
    {
        "sessionspeakers": "Kees Jan Koster",
        "fulllink": "http://www.devoxx.com/display/DV09/A+Year+of+Monitoring+with+Java-monitor",
        "room": "4",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258476300",
        "sessiontitle": "A Year of Monitoring with Java-monitor",
        "datetime": "16:45-17:15",
        "unixend": "1258478100",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "The Java-monitor community has gathered just over a year of monitoring experience. In this session Kees Jan will present a few case studies of real-life problems and solutions that we came across.\n\nWe will examine strange garbage collector behaviour, talk about file descriptors in GlassFish, look at what memory leaks look like and how to tune memory pools in JVM's.\n\nThis presentation is most interesting to developers who got bullied into being the local Java system administrator too. You will learn what to monitor and look at in order to be able to assess the health of our JVM in production.\n\nIt is also very informative for system administrators who have been pressed into being responsible for a Java application server. You will learn more about the internals of a JVM, without having to learn Java.",
        "sessionlink": "http://www.devoxx.com/display/DV09/A+Year+of+Monitoring+with+Java-monitor"
    },
    {
        "sessionspeakers": "Hildeberto Mendon�a, Kenia Sousa",
        "fulllink": "http://www.devoxx.com/display/DV09/Linking+Business+Processes+with+User+Interfaces",
        "room": "9",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258476300",
        "sessiontitle": "Linking Business Processes with User Interfaces",
        "datetime": "16:45-17:15",
        "unixend": "1258478100",
        "sessiontime": "16:45-17:15",
        "sessionabstract": "Usi4Biz is a tool developed on the Java platform, in the context of a PhD research at the Université catholique de Louvain, to assist business analysts associating business processes activities with user interfaces that are used to perform these activities, and also make end-users aware of which activities of the business process they are performing when using a specific user interface. The basis of this approach is a network of links from business process models, imported from existing modeling tools, until final user interfaces, independent of the technology in which they were developed. The benefits of this approach impacts not only IT stakeholders, but end-users and business analysts by: a) concretely representing how activities are performed through organization's systems; b) showing the impact of business modifications on the way users are going to operate systems; c) keeping the end-users aware of which part of the process is being executed when interacting with a specific user interface; d) allowing end-users to report bottlenecks and suggestions of improvement in user interfaces that cannot be detected by monitoring tools; and e) providing analytical data that supports the analysis of users, user interfaces and business processes, enabling fast adaptation to the business dynamism.\n\nInstead of using existing IT approaches, such as SOA, to manage processes and its technological implementation, we are focusing on people who are the ones who effectively perform the processes though systems. These systems are considered, mainly their user interfaces, but agile methodologies have been showing that giving more attention to people, systems become naturally more adapted to their work, independent of the applied technology.\n\nDuring the session, we are going to shortly present the problematic addressed by the tool, more details about its software architecture, integration with existing tools and some results of its application in large organizations in Belgium.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Linking+Business+Processes+with+User+Interfaces"
    },
    {
        "sessionspeakers": "Frank Sommers",
        "fulllink": "http://www.devoxx.com/display/DV09/Scala+Actors",
        "room": "8",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258478700",
        "sessiontitle": "Scala Actors",
        "datetime": "17:25-17:55",
        "unixend": "1258480500",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "The advent of multicore processors has brought about renewed interest in concurrent programming: To harness the abilities of multicore CPUs, programs must be written with concurrency in mind. Actors provide an alternative paradigm to threads in developing concurrent programs.\n\nLanguages and tools that support Actor-based programming have become increasingly popular. Scala Actors make actor-based concurrency available on the Java Virtual Machine, and enable JVM-based applications to scale to potentially thousands of concurrently executing processor cores or processors.\n\nThis talk provides an introductory tutorial on Scala Actors: It explains the main Actor concepts and APIs, and provides tips and techniques on how to maximize the benefits of Actor-based concurrency to scale both Scala and Java programs on the JVMs.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Scala+Actors"
    },
    {
        "sessionspeakers": "Anton Epple, Geertjan Wielenga",
        "fulllink": "http://www.devoxx.com/display/DV09/Lookup+-+A+new+OSGi+Service+Registry",
        "room": "5",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258478700",
        "sessiontitle": "Lookup - A new OSGi Service Registry",
        "datetime": "17:25-17:55",
        "unixend": "1258480500",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "The Lookups bundle adds a new simple, elegant and powerful way to register and retrieve services in OSGi. Originally part of the NetBeans platform this mechanism has been ported to work with OSGi. In this talk I'll compare Lookups with OSGi Services, Dynamic Services, Declarative Services and Blueprint services to show the drawbacks and benefits of the individual systems.\n\nLookups were originally invented as a basic pattern for loosely coupled communication in the NetBeans platform. Thinking of them as a data structure they are typesave, observable maps that take class objects as keys and return instances of the class. Lookups also provide an implementation for the Service Provider Registration mechanism detailed in the JDK 1.3 specification, that is more powerful and adds a lot of additional features. Due to the simplicity, type-safety, standard compliance and performance this approach is also very useful in OSGi. In a plain Java application you simply need to drop the jar on you classpath and it works. We made this mechanism available for OSGi as well.\n\nAfter this presentation participants will have:\n\nA good understanding of JDK 1.6 ServiceLoader mechanism\n\nA good understanding what the Lookup pattern is\n\nA better understanding about the benefits and drawbacks of different service infrastructures\n\nA new tool in their OSGi toolbox",
        "sessionlink": "http://www.devoxx.com/display/DV09/Lookup+-+A+new+OSGi+Service+Registry"
    },
    {
        "sessionspeakers": "Vaclav Pech",
        "fulllink": "http://www.devoxx.com/display/DV09/TeamCity+-+Continuous+Integration%2C+Build+Management%2C+and+avoiding+broken+builds",
        "room": "4",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258478700",
        "sessiontitle": "TeamCity - Continuous Integration, Build Management, and avoiding broken builds",
        "datetime": "17:25-17:55",
        "unixend": "1258480500",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "When Martin Fowler first wrote about Continuous Integration, he described it as a practice that changes integration from a \"long and unpredictable process\" to a \"non-event\" - something that every team could use to make their code more reliable and clean, with minimal effort. Using code-level demonstrations, we will go through the CI practice using TeamCity, a distributed build management and continuous integration system which was designed specifically to improve team communication, integrate into the development process, run builds, detect problems, and report issues in a non-intrusive way, so that your code base stays clean and your projects are completed faster.",
        "sessionlink": "http://www.devoxx.com/display/DV09/TeamCity+-+Continuous+Integration%2C+Build+Management%2C+and+avoiding+broken+builds"
    },
    {
        "sessionspeakers": "Frederic Marius",
        "fulllink": "http://www.devoxx.com/display/DV09/Smals-IDE+-+open+source+to+the+rescue",
        "room": "9",
        "tags": "Tools in Action",
        "track": "Tools In Action",
        "unixstart": "1258478700",
        "sessiontitle": "Smals-IDE - open source to the rescue",
        "datetime": "17:25-17:55",
        "unixend": "1258480500",
        "sessiontime": "17:25-17:55",
        "sessionabstract": "Smals is a medium sized company. We have more than 250 Java/JEE programmers together with as much analysts working on +100 projects. Most of these projects are in the same domain (health care, social security) A few years ago we were confronted with the harsh truth that, although each team was efficient in solving his problem, the coming-together of all the solutions on our infrastructure and vis-� -vis the clients was far from ideal. Quality Assurance was a problem. In an attempt to solve some of the problems an initiative was started a few years ago to unify the Smals developers community. This resulted in the Smals-IDE which consists of an IDE, a continuous build and test environment and a release system, all based on open source tools with some customizations. We hope this presentation will demonstrate that some organizing coupled with open source tooling can help a business to become more responsive to the market and improve quality of service. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Smals-IDE+-+open+source+to+the+rescue"
    },
    {
        "sessionspeakers": "Emmanuel Bernard, Roberto Chinnici, Alexis Moussine-Pouchkine, Antonio Goncalves, Paul Sandoz",
        "fulllink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753434",
        "room": "1",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258484400",
        "sessiontitle": "Why should I care about Java EE 6 ?",
        "datetime": "19:00-20:00",
        "unixend": "1258488000",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "Why should I care about Java EE 6 ? \nWhy should I care about a technology that is 10 years old ? \nWhy should I care about EJBs ? \nEJBs ?!? \nIs anybody still using EJBs ? \nWhy should I run my applications in a heavy application server ? \nWhy are you bothering me ?\n\nCome and express your anger in this informal session with JEE6 spec. leads, expert members, enthusiasts and friends.",
        "sessionlink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753434"
    },
    {
        "sessionspeakers": "Sebastian Hennebrueder",
        "fulllink": "http://www.devoxx.com/display/DV09/Selecting+web+technologies",
        "room": "2",
        "tags": "Web",
        "track": "BOFs",
        "unixstart": "1258484400",
        "sessiontitle": "Selecting web technologies",
        "datetime": "19:00-20:00",
        "unixend": "1258488000",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "The choice of web frameworks and web technologies is continuously growing. Classic web application spiced up with Ajax, web applications rendered on a single page using plugins or Javascript offer interesting alternatives. The ease of integrating dynamic languages into Java adds another dimension to the technology landscape. Is GWT better than JSF, Tapestry better then Dojo or JavaFx preferable over Stripes, Ruby on Rails or Grails. This BOF tries to provide you with a guidance how to select web technologies and explains pros and cons of different approaches. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Selecting+web+technologies"
    },
    {
        "sessionspeakers": "Lieven Doclo",
        "fulllink": "http://www.devoxx.com/display/DV09/Spring+Rich+Client",
        "room": "1",
        "tags": "Swing",
        "track": "BOFs",
        "unixstart": "1258488000",
        "sessiontitle": "Spring Rich Client",
        "datetime": "20:00-21:00",
        "unixend": "1258491600",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Spring Rich Client is an application framework to build Swing applications, powered by the Spring Framework. This talk is all about getting started with Spring Rich Client and discovering how you can fit it into your Swing development. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Spring+Rich+Client"
    },
    {
        "sessionspeakers": "Nicolas Leroux",
        "fulllink": "http://www.devoxx.com/display/DV09/Play+framework+in+practice",
        "room": "2",
        "tags": "Web",
        "track": "BOFs",
        "unixstart": "1258488000",
        "sessiontitle": "Play framework in practice",
        "datetime": "20:00-21:00",
        "unixend": "1258491600",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "This presentation introduces the Play! framework to the audience. The Play! framework is a framework that introduces conventations over configuration paradigm and easy support for RESTful web application. This framework is one of the few to be completely stateless. It also emphasis on the RESTful architecture. Through a small application we will discover the wonderful world of the play framework and how easy and fast it is to develop a web application.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Play+framework+in+practice"
    },
    {
        "sessionspeakers": "Filippo Diotalevi",
        "fulllink": "http://www.devoxx.com/display/DV09/Felix+and+More",
        "room": "1",
        "tags": "Enterprose",
        "track": "BOFs",
        "unixstart": "1258491600",
        "sessiontitle": "Felix and More",
        "datetime": "21:00-22:00",
        "unixend": "1258495200",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "Born as an OSGi implementation, Apache Felix has grown to host a number of sub-projects that are of particular interest for OSGi developers, like Apache Felix Karaf, Apache Felix IPOJO, FileInstall and Sigil.\n\nThe purpose of this BOF is to gather all OSGi developers to present what's available in Apache Felix and to discuss problems and strategies to successfully develop OSGi applications with Apache Felix.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Felix+and+More"
    },
    {
        "sessionspeakers": "Tom Mahieu",
        "fulllink": "http://www.devoxx.com/display/DV09/Dojo+Users+and+Developers+meeting",
        "room": "2",
        "tags": "Web",
        "track": "BOFs",
        "unixstart": "1258491600",
        "sessiontitle": "Dojo Users and Developers meeting",
        "datetime": "21:00-22:00",
        "unixend": "1258495200",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "The main goal of a dojo Users & Developers meeting, a.k.a. dojo.beer (), is to meet other dojo developers. For all you know, your neighbour developer uses dojo foundation technologies in a similar project as yours. In this BOF, people will be given the chance to give a short (10-15 minute) talk/presentation about their experience with dojo in the projects they've worked on. After this introduction, everyone gets the opportunity to discuss their dojo experiences with each other over a nice dojo.beer().\n\nPeople that are willing to give a short (10-15 minute) presentation about their experiences with the dojo toolkit or any other dojo foundation technology, please send a short abstract of your talk to Tom Mahieu . In case there are too many proposals, the attendees will get the chance to choose their preferred talks.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Dojo+Users+and+Developers+meeting"
    },
    {
        "sessionspeakers": "Vaclav Pech",
        "fulllink": "http://www.devoxx.com/display/DV09/GParallelizer+-+parallelize+your+Groovy+enjoyment",
        "room": "8",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258462800",
        "sessiontitle": "GParallelizer - parallelize your Groovy enjoyment",
        "datetime": "13:00-13:15",
        "unixend": "1258463700",
        "sessiontime": "13:00-13:15",
        "sessionabstract": "Low-level concurrency handling is usually hard to get right. And it's not much fun either. In this hands-on session we will go through the concurrency options that GParallelizer library, an open-source concurrency library for Groovy, gives to your Groovy applications. We'll cover asynchronous collection processing, actors and other concepts, which aim to make your Groovy code concurrent with little effort. \nWe'll create and show code examples in Groovy illustrating the principles of actors, parallel arrays and dataflow concurrency, while leveraging the DSLs offered by GParallelizer.",
        "sessionlink": "http://www.devoxx.com/display/DV09/GParallelizer+-+parallelize+your+Groovy+enjoyment"
    },
    {
        "sessionspeakers": "Peter Lubbers",
        "fulllink": "http://www.devoxx.com/display/DV09/Stock+Ticker",
        "room": "5",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258462800",
        "sessiontitle": "Stock Ticker",
        "datetime": "13:00-13:15",
        "unixend": "1258463700",
        "sessiontime": "13:00-13:15",
        "sessionabstract": "HTML5 introduces Web Sockets - a full-duplex, bidirectional communications channel that operates over a single socket - allowing you to do all kinds of incredible things from your web applications. For example, you can communicate with any TCP-based back-end service (Stomp, JMS, Jabber, XMPP, and so on), which enables developers to code directly against back-end services.\n\nIn this 15-minute micro workshop, Peter will blitz through the creation of a JavaScript stock ticker application that communicates directly with a back-end RabbitMQ message broker using Stomp. The demo will leverage the Kaazing Gateway, an enterprise WebSocket server. In the process Peter will demonstrate the powerful simplicity of HTML5 WebSocket API programming and when done you will see real-time TCP-based back-end service communication using HTML5 Web Sockets in action. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Stock+Ticker"
    },
    {
        "sessionspeakers": "Antonio Marin Neto",
        "fulllink": "http://www.devoxx.com/display/DV09/CoSMO+-+Conference+Schedule+Mobile",
        "room": "4",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258462800",
        "sessiontitle": "CoSMO - Conference Schedule Mobile",
        "datetime": "13:00-13:15",
        "unixend": "1258463700",
        "sessiontime": "13:00-13:15",
        "sessionabstract": "CoSMo is a Java ME software that's make an event schedule available on mobile devices and it's available under GPL license as a open-source project on Java.net: http://cosmo.dev.java.net \nThis project intend to be a conference tool, where you will be able to create all schedule and export it to the mobile clients and users will be able to exchange with other users (contacts, chats, business cards, etc) and with the \"event\" (receive warnings, promotions, surveys, etc).",
        "sessionlink": "http://www.devoxx.com/display/DV09/CoSMO+-+Conference+Schedule+Mobile"
    },
    {
        "sessionspeakers": "Ludovic Champenois",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+EE+6+and+OSGi",
        "room": "9",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258462800",
        "sessiontitle": "Java EE 6 and OSGi",
        "datetime": "13:00-13:15",
        "unixend": "1258463700",
        "sessiontime": "13:00-13:15",
        "sessionabstract": "GlassFish Java EE 6 is built on top of OSGi. This help the modularization of the new Java EE profiles, and introduce new ways to approach the development of enterprise applications, using the combined power of the Java EE APIs and the OSGi concepts.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+EE+6+and+OSGi"
    },
    {
        "sessionspeakers": "Stephan Janssen, Steven Harris, Roberto Chinnici, Ludovic Champenois, Christophe Coenraets",
        "fulllink": "null",
        "room": "8",
        "tags": "Keynotes",
        "track": "Conference",
        "unixstart": "1258536600",
        "sessiontitle": "Keynotes",
        "datetime": "9:30-11:30",
        "unixend": "1258543800",
        "sessiontime": "9:30-11:30",
        "sessionabstract": "Welcome and Intro by Stephan Janssen (20m)\n\nJava, the Platform for the Future by Steven Harris (Oracle) (45m)\n\nJava EE 6 and GlassFish V3: Evolution of a Platform by Roberto Chinnici and Ludovic Champenois (20m)\n\nIntegrating designers into your application development by Christophe Coenraets (Adobe) (20m)\n\nJava, the Platform for the Future:\nThe Java platform has shown a remarkable success and resiliency in adapting to changes in technology and adoption patterns over time. This success is powered by the community of developers and users. Today the Java platform faces new challenges. We will examine these challenges and the keys to meeting them in order to broaden Java adoption and improve competitiveness.\n\nJava EE 6 and GlassFish V3: Evolution of a Platform:\nIn this keynote we present the principles that guided the design of the Java EE 6 platform and of the GlassFish V3 application server.\nLike any complex software system, both Java EE 6 and GlassFish are subject to a lot of competing pressures and face a host of constraints.\nAt the same time, there are clear expectations in terms of what the next version of each should deliver: new functionality (e.g. scripting support, easy and extensible administration, integrated tooling, monitoring), better performance, OSGi compatibility, etc.\nWe will describe the balancing act that we performed in developing both systems in parallel and highlight the importance of the feedback cycle between specification and implementation.\n\nIntegrating designers into your application development:\nLet's face it ... A designer and a developer are 2 different kind of people. While one is creating the experience, the other one is making things work. And even though they are different, combining their powers is the only way to create those great rich internet applications.\nAdobe created Flash Catalyst for designers, and Flash Builder for developers ... 2 tools that enable these users to build the entire application from the experience down to the code, all using the open source Flex framework.",
        "sessionlink": "null"
    },
    {
        "sessionspeakers": "Mark Reinhold",
        "fulllink": "http://www.devoxx.com/display/DV09/JDK7+Update",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258545600",
        "sessiontitle": "JDK7 Update",
        "datetime": "12:00-13:00",
        "unixend": "1258549200",
        "sessiontime": "12:00-13:00",
        "sessionabstract": " A survey of the key features being developed for JDK 7, by both Sun and non-Sun contributors, followed by a speculative look at potential features for future releases.",
        "sessionlink": "http://www.devoxx.com/display/DV09/JDK7+Update"
    },
    {
        "sessionspeakers": "Nicolai Josuttis",
        "fulllink": "http://www.devoxx.com/display/DV09/ESB%27s+and+WebServices+in+Practice",
        "room": "5",
        "tags": "SOA",
        "track": "Conference",
        "unixstart": "1258545600",
        "sessiontitle": "ESB's and WebServices in Practice",
        "datetime": "12:00-13:00",
        "unixend": "1258549200",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "One element of SOA is the approach to provide interoperability. The usual concept is an Enterprise Service Bus (ESB). But if you try just to buy a commercial ESB or use an Open Source ESB you are lost. ESB's use very different fundamental concepts, companies sell different ESB's without explaining why, and for standards such as Web Services there are major debates whether this is a (useful) ESB.\n\nIn this talk Nicolai Josuttis will give an overview of different ESB approaches and what it really means to bring an ESB as part of a SOA strategy into operation.",
        "sessionlink": "http://www.devoxx.com/display/DV09/ESB%27s+and+WebServices+in+Practice"
    },
    {
        "sessionspeakers": "Eric Steegmans",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+Generics+in+Action",
        "room": "4",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258545600",
        "sessiontitle": "Java Generics in Action",
        "datetime": "12:00-13:00",
        "unixend": "1258549200",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "Since version 5, Java supports the definition of generic classes, generic interfaces and generic methods. Even before their final release, the new language constructs were praised by some and criticized by others. For reasons of backward compatibility, Java erases all information related to genericity at runtime. This talk starts with a critical view on type erasure, pinpoints potential dangers in developing generic classes and interfaces, and illustrates how it might jeopardize client code. We then focus on wild cards that serve two different purposes in the language. First of all, we discuss how wild cards support restricted genericity in a rather elegant way. We then explain why type erasure complicates polymorphic assignments by imposing wild cards on variable declarations.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+Generics+in+Action"
    },
    {
        "sessionspeakers": "Scott Ambler",
        "fulllink": "http://www.devoxx.com/display/DV09/Agile+Mythbusters",
        "room": "9",
        "tags": "Methodology",
        "track": "Conference",
        "unixstart": "1258545600",
        "sessiontitle": "Agile Mythbusters",
        "datetime": "12:00-13:00",
        "unixend": "1258549200",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "There are many myths regarding agile software development. Some of the myths are that agile has been adopted by the majority of development teams, that agile approaches are more effective than waterfall approaches, that agile is empirical, that agile teams don't do up front requirements or architecture, that agile teams produce less documentation, that it is common for agile teams to take a test-driven approach, and many more. Several of those myths are true, several false, and some we're not so sure about yet. This talk summarizes the results of 4 years of industry surveys concerning the adoption and effectiveness of agile techniques. Very often the reality is significantly different than the rhetoric presented in mailing lists, in articles, and even in books. It is time to cut through the dogma promoted by agile consultants and instead focus on what agile practitioners are actually doing on their projects.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Agile+Mythbusters"
    },
    {
        "sessionspeakers": "Howard Lewis Ship",
        "fulllink": "http://www.devoxx.com/display/DV09/Clojure",
        "room": "6",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258545600",
        "sessiontitle": "Clojure",
        "datetime": "12:00-13:00",
        "unixend": "1258549200",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "Talk about strange bedfellows: what happens when you mix one part Lisp (one of the oldest computer languages), one part Java (so young, yet so well adopted), a healthy serving of functional programming, and a state-of-the-art concurrency layer on top? That's Clojure, which \"feels like a general-purpose language beamed back from the near future.\" \n\nClojure embraces functional programming with immutable data types and first class functions. It is fully interoperable with Java. Clojure's approach to concurrency includes asynchonous Agents, and Software Transactional Memory. \n\nClojure is fast, elegant, dynamic, and scalable: a language for the future, today.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Clojure"
    },
    {
        "sessionspeakers": "James Gosling",
        "fulllink": "http://www.devoxx.com/display/DV09/James+Gosling",
        "room": "8",
        "tags": "JavaSE",
        "track": "Conference",
        "unixstart": "1258552800",
        "sessiontitle": "James Gosling",
        "datetime": "14:00-15:00",
        "unixend": "1258556400",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "The father of Java",
        "sessionlink": "http://www.devoxx.com/display/DV09/James+Gosling"
    },
    {
        "sessionspeakers": "Chris Richardson",
        "fulllink": "http://www.devoxx.com/display/DV09/Amazon+Elastic+Compute+Cloud+%28EC2%29",
        "room": "5",
        "tags": "Cloud",
        "track": "Conference",
        "unixstart": "1258552800",
        "sessiontitle": "Amazon Elastic Compute Cloud (EC2)",
        "datetime": "14:00-15:00",
        "unixend": "1258556400",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "The Amazon Elastic Compute Cloud (EC2) is a virtualized computing environment where you rapidly provision and manage servers via a web services API. It is ideally suited to running Java applications because it allows you to develop applications using standard software packages such as Tomcat and MySQL. However, because it is a cloud, some aspects of EC2 are very different than a traditional, physical computing environment, which impacts how you handle security, networking, storage and availability.\n\nIn this session, which is aimed at senior Java developers and architects, you will learn:\n\nHow to use EC2 and the other Amazon web services to develop and deploy Java EE applications\n\nHow to significantly simplify common administrative tasks such as upgrades\n\nHow to design highly available applications with EC2 availability zones\n\nHow to architect secure applications for Amazon EC2",
        "sessionlink": "http://www.devoxx.com/display/DV09/Amazon+Elastic+Compute+Cloud+%28EC2%29"
    },
    {
        "sessionspeakers": "Brian Goetz",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Concurrency+Revolution",
        "room": "4",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258552800",
        "sessiontitle": "The Concurrency Revolution",
        "datetime": "14:00-15:00",
        "unixend": "1258556400",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "Everyone is saying we need a revolution in the way we approach concurrency; the availability of cheap multiprocessor systems has brought concurrency, which used to be a topic for experts only, into the foreground. How did we get here? Why are the performance-enhancing techniques that worked for twenty years no longer working, and how did this become such a problem that we have to change our programming models? In this talk, we'll dive under the hood and look at the hardware trends that have forced us to turn away from increasing sequential performance and towards multicore CPUs and chip multi-threading, and look at the implications for software design and performance analysis.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Concurrency+Revolution"
    },
    {
        "sessionspeakers": "Frank Greco",
        "fulllink": "http://www.devoxx.com/display/DV09/HTML+5+Communications+-+The+New+Network+Framework+for+the+Web",
        "room": "9",
        "tags": "Kaazing Partner Slot",
        "track": "Conference",
        "unixstart": "1258552800",
        "sessiontitle": "HTML 5 Communications - The New Network Framework for the Web",
        "datetime": "14:00-15:00",
        "unixend": "1258556400",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "The HTML 5 specification will clearly change the way in which we build applications for the Web. Google, Apple, Mozilla, Opera, Palm, et al, have all made large strides in supporting various components of HTML 5. The Communications section of this specification describes an exciting collection of new types of network communication mechanisms that will provide the underpinnings of the next generation of web applications.\n\nWebSocket A full-duplex single-socket connection over the web\n\nServer-Sent Events A formalization of web \"push\" but without polling\n\nCross-Domain Resource Sharing Connect to multiple domains without a portal server\n\nInter-Document Messaging Send messages among iframes on a page\n\nThese features bring bi-directional, event-driven connectivity to web applications, remove the dependency on polling, allows the browser to be the aggregator of information across domains and facilitates mashups within the browser.\n\nWe will provide an in-depth look into the use of these features particularly WebSocket and Server-Sent Events. And we'll discuss the techniques and technologies required to build Web applications with these new tools. We will also cover possible network architectures to integrate message brokers, popular data feeds and cloud applications using WebSockets.\n\nThe session will show demonstrations using the Kaazing Gateway, the first implementation of the HTML 5 Communications stack which also offers Java/JavaFX, Flash/Flex, Javascript and Silverlight client-side libraries.",
        "sessionlink": "http://www.devoxx.com/display/DV09/HTML+5+Communications+-+The+New+Network+Framework+for+the+Web"
    },
    {
        "sessionspeakers": "Ceki Gulcu",
        "fulllink": "http://www.devoxx.com/display/DV09/SLF4J+and+logback",
        "room": "6",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258552800",
        "sessiontitle": "SLF4J and logback",
        "datetime": "14:00-15:00",
        "unixend": "1258556400",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "SLF4J is a logging abstraction gaining wide acceptance in the Java community. Logback is the successor of the log4j project. The talk will present both SLF4J and logback projects.\n\nThe logging abstraction problem will be presented. SLF4J tackles this problem in a decidedly unsophisticated manner. There are valuable lessons to be learned from SLF4J's approach.\n\nLogback, as the successor to log4j, is an evolution of the former project. It builds on the log4j experience, first by modularizing according to intended usage and second by simplifying the implementation. As a result, logback accomplishes more with less code.\n\nThe talk will demonstrate some of the unique capabilities found in logback.",
        "sessionlink": "http://www.devoxx.com/display/DV09/SLF4J+and+logback"
    },
    {
        "sessionspeakers": "Antonio Goncalves",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Java+EE+6++Platform",
        "room": "8",
        "tags": "Enterprise Java",
        "track": "Conference",
        "unixstart": "1258557000",
        "sessiontitle": "The Java EE 6 Platform",
        "datetime": "15:10-16:10",
        "unixend": "1258560600",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Take a deep breath at Java EE 6. In this session, Antonio Goncalves will present the just released Java EE 6 plateform with slides, showing you code, and demoing a Java EE 6 application using open-source implementations. Antonio will show you some novelties of the plateform : new EJBs, simplified packaging, an enriched persistence layer, a new API for RESTful services, a validation framework, a radical simplification of the web layer and ... many other improvements that make Java EE 6 ideal for your applications. Java EE 6 applications combine standards and robustness. Come to this university talk and check it out by yourself.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Java+EE+6++Platform"
    },
    {
        "sessionspeakers": "Tom Baeyens",
        "fulllink": "http://www.devoxx.com/display/DV09/jBPM4+in+Action",
        "room": "5",
        "tags": "BPM",
        "track": "Conference",
        "unixstart": "1258557000",
        "sessiontitle": "jBPM4 in Action",
        "datetime": "15:10-16:10",
        "unixend": "1258560600",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Learn how to orchestrate your Java asynchronous architectures. jBPM is the leading BPM and workflow engine. The business value of BPM is well known. But jBPM is unique in offering that value in a way that developers love it. jBPM is based on the Process Virtual Machine, which enables it to support multiple process languages like jPDL and BPMN. We'll show a concrete example of how to build a train ticket application based on jBPM. And we demonstrate how the process file looks like, how to use the new API and how it fits into any plain Java application architecture.\n\nAttend also: Meet the jBPM Team BOF on Monday.",
        "sessionlink": "http://www.devoxx.com/display/DV09/jBPM4+in+Action"
    },
    {
        "sessionspeakers": "Maarten Cox, Serge Jespers",
        "fulllink": "http://www.devoxx.com/display/DV09/Design+to+Development+-+Flash+Catalyst+to+Flex",
        "room": "4",
        "tags": "XPlore Partner Slot",
        "track": "Conference",
        "unixstart": "1258557000",
        "sessiontitle": "Design to Development - Flash Catalyst to Flex",
        "datetime": "15:10-16:10",
        "unixend": "1258560600",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Learn how using Flash Catalyst and Flash Builder 4 together enables designers and developers to work jointly to create high-fidelity rich Internet applications. A number of examples will be shown together with a case study of \"BandGeek\", an AIR/Flex application made by iDA MediaFoundry",
        "sessionlink": "http://www.devoxx.com/display/DV09/Design+to+Development+-+Flash+Catalyst+to+Flex"
    },
    {
        "sessionspeakers": "Cameron Purdy",
        "fulllink": "http://www.devoxx.com/display/DV09/Traditional+Programming+Models",
        "room": "9",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258557000",
        "sessiontitle": "Traditional Programming Models: Stone Knives and Bearskins in the Google Age",
        "datetime": "15:10-16:10",
        "unixend": "1258560600",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Programming has been taught using roughly the same approach for decades, but today's systems use radically different architectures - consider the explosion in the count of processors and cores, massively distributed environments running parallel computations, and fully virtualized operating environments.\n\nLearn how many of yesterday's programming principles have inadvertently become today's worst practices, and how these anti-patterns continue to form the basis of modern programming languages, frameworks and infrastructure software.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Traditional+Programming+Models"
    },
    {
        "sessionspeakers": "Jasper Potts, Richard Bair",
        "fulllink": "http://www.devoxx.com/display/DV09/JavaFX",
        "room": "6",
        "tags": "RIA",
        "track": "Conference",
        "unixstart": "1258557000",
        "sessiontitle": "JavaFX",
        "datetime": "15:10-16:10",
        "unixend": "1258560600",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "JavaFX is a next generation client platform for Java developers. In this session, we will focus on how JavaFX applies to traditional enterprise rich-client application development. We will cover design patterns and idioms, enhancing the user experience through good visual design and the use of several data access strategies. Come see how to be more productive by building your next application with JavaFX.",
        "sessionlink": "http://www.devoxx.com/display/DV09/JavaFX"
    },
    {
        "sessionspeakers": "Bill Venners",
        "fulllink": "http://www.devoxx.com/display/DV09/Get+Higher+with+ScalaTest",
        "room": "8",
        "tags": "JVM",
        "track": "Conference",
        "unixstart": "1258562400",
        "sessiontitle": "Get Higher with ScalaTest",
        "datetime": "16:40-17:40",
        "unixend": "1258566000",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Newer JVM languages such as JRuby, Groovy, and Scala let you work at a higher level than Java. This talk will show you ScalaTest, a new testing tool that will let you work at a higher level than JUnit and TestNG. You'll learn about high-level features of Scala such as traits and self-types, implicit conversions and parameters, functions and closures, and internal DSLs, and see how ScalaTest exploits these features to help you work more productively. You'll see how you can reduce the lines of test code you write by half and more, how to mix Scala into your existing JUnit or TestNG infrastructure, and how to use Scala in various testing styles, including unit testing, behavior-driven development, integration and acceptance testing, and high-level property-based testing. You need not already know Scala to attend this talk, as you will be taught just enough Scala to understand the examples.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Get+Higher+with+ScalaTest"
    },
    {
        "sessionspeakers": "Erik Hatcher",
        "fulllink": "http://www.devoxx.com/display/DV09/Solr+Power+with+Lucene",
        "room": "5",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258562400",
        "sessiontitle": "Solr Power with Lucene",
        "datetime": "16:40-17:40",
        "unixend": "1258566000",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Solr powers the search of many enterprise applications, and long before Solr shone on enterprise search, Lucene - Solr's core library, was and still is used to drive the search of applications pervasively around the world. In this university lecture we'll cover the typical workflow of getting data into Solr, configuring Solr's indexing and search processes, and building a searching client user interface. Common indexing options will be explored: database (JDBC) indexing, RSS/Atom and other XML data sources, CSV formatted data, rich text (Word, PDF, HTML, etc) documents and indexing through Solr's various native language APIs. Solr's configurability and usage options discussion will include query parsing, faceting, relevancy ranking, spell checking, highlighting, clustering and more-like-this.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Solr+Power+with+Lucene"
    },
    {
        "sessionspeakers": "Paul Sandoz, Jean-Francois Arcand",
        "fulllink": "http://www.devoxx.com/display/DV09/Writing+Asynchronous+Web+application+%28Comet%29+using+the+Atmosphere+Framework",
        "room": "4",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258562400",
        "sessiontitle": "Writing Asynchronous Web application (Comet) using the Atmosphere Framework",
        "datetime": "16:40-17:40",
        "unixend": "1258566000",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Atmosphere is a high-level API designed to make it easier to build Comet-based Web applications that include a mix of Comet and RESTful behavior. Today writing portable Web applications that can use the power of the Comet technique is almost impossible: Tomcat, Jetty, and Grizzly/GlassFish application server all have their own set of private APIs.\n\nAtmosphere leverages and builds on Project Jersey and the Java API for RESTful Web Services (JAX-RS). Jersey is the open resource reference implementation of JAX-RS that makes it easier to build RESTful Web services. Atmosphere and Jersey complement each other, with the goal of making it easier to build Comet-based Web applications that include a mix of Comet and RESTful behavior.\n\nThis session briefly explains what Comet is and demonstrates the power of Atmosphere by building multiple applications, starting with a simple chat, then building a REST Twitter-like application, and many more\n\nAttendees will learn what Comet is and how to write portable applications by using Atmosphere and using the language of there choice: Java, JRuby, Scala and Groovy",
        "sessionlink": "http://www.devoxx.com/display/DV09/Writing+Asynchronous+Web+application+%28Comet%29+using+the+Atmosphere+Framework"
    },
    {
        "sessionspeakers": "Christophe Herreman",
        "fulllink": "http://www.devoxx.com/display/DV09/Spring+ActionScript",
        "room": "9",
        "tags": "RIA",
        "track": "Conference",
        "unixstart": "1258562400",
        "sessiontitle": "Spring ActionScript",
        "datetime": "16:40-17:40",
        "unixend": "1258566000",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Spring ActionScript is an offshoot of Java Spring and brings Inversion of Control to the Flash Platform. Primarily focusing on Flex and AIR development, you'll learn how this framework can be used to build testable and maintainable applications. We'll take a look at the different kinds of configuration options and will also see how the minimal MVCS infrastructure fits into an application.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Spring+ActionScript"
    },
    {
        "sessionspeakers": "Doug Tidwell",
        "fulllink": "http://www.devoxx.com/display/DV09/Keeping+Your+Options+Open%2C+Even+if+the+Cloud+is+Not",
        "room": "6",
        "tags": "IBM Partner Slot",
        "track": "Conference",
        "unixstart": "1258562400",
        "sessiontitle": "Keeping Your Options Open, Even if the Cloud is Not",
        "datetime": "16:40-17:40",
        "unixend": "1258566000",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Cloud computing is a major shift in the way applications and data are deployed and managed. Once you've chosen a cloud vendor, how can you avoid being locked in to a proprietary API or service? And even if you're happy with your cloud provider, what happens when you partner with someone who uses different cloud services? Unfortunately, the picture of cloud standards is, well, cloudy. In this session we'll look at the services provided by the major cloud vendors and the standards efforts of various standards bodies. From there we'll look at design patterns and code libraries to make your cloud computing applications as robust, vendor-independent and open as possible.\n\nCloud computing is possible because of the virtualization and commoditization of hardware and processing power; to make the most of it, we'll need standardization as well.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Keeping+Your+Options+Open%2C+Even+if+the+Cloud+is+Not"
    },
    {
        "sessionspeakers": "Joseph D. Darcy",
        "fulllink": "http://www.devoxx.com/display/DV09/Project+Coin",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258566600",
        "sessiontitle": "Project Coin",
        "datetime": "17:50-18:50",
        "unixend": "1258570200",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Project Coin: Growing a Language Without Stretch Marks \n\nProject Coin aims to first determine what set of small language changes should be added to JDK 7 and then to incorporate those changes into the platform. Besides discussing the actual language changes, this talk will discuss the criteria and considerations used to evaluate language proposals and judge their utility and appropriateness to the platform.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Project+Coin"
    },
    {
        "sessionspeakers": "Gregor Hohpe",
        "fulllink": "http://www.devoxx.com/display/DV09/Distributed+Programming+the+Google+Way",
        "room": "5",
        "tags": "Cloud",
        "track": "Conference",
        "unixstart": "1258566600",
        "sessiontitle": "Distributed Programming the Google Way",
        "datetime": "17:50-18:50",
        "unixend": "1258570200",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Google is known to run one the largest civilian computing infrastructures in the world. Portions of this infrastructure have been made available as open source projects or published in academic papers: MapReduce, GFS, Sawzall, Chubby, Protocol Buffers, and more. Because the extend of Google's software infrastructure (both public and proprietary) is mindboggling, this talk distills recurring design themes or patterns, which can be reused in other contexts.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Distributed+Programming+the+Google+Way"
    },
    {
        "sessionspeakers": "Timothy Perrett",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Lift+%28Scala%29+Web+Framework",
        "room": "4",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258566600",
        "sessiontitle": "The Lift (Scala) Web Framework",
        "datetime": "17:50-18:50",
        "unixend": "1258570200",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Lift is an expressive, elegant framework for writing Web applications. It stresses the importance of security, scalability, and performance while enabling high levels of developer productivity. Lift applications, written in Scala and deployed as WAR files offer very high performance and are being deployed in organizations as diverse as web 2.0 start-ups, right up to companies such as SAP. In this session, project committer Timothy Perrett, gives an overview of Lift and demonstrates its advantages for building rich Internet applications.\n\nThis presentation is intended for Web application developers and architects who want to learn about leading-edge technologies on the JVM platform.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Lift+%28Scala%29+Web+Framework"
    },
    {
        "sessionspeakers": "Chet Haase, Romain Guy",
        "fulllink": "http://www.devoxx.com/display/DV09/Animation+Rules",
        "room": "9",
        "tags": "RIA",
        "track": "Conference",
        "unixstart": "1258566600",
        "sessiontitle": "Animation Rules",
        "datetime": "17:50-18:50",
        "unixend": "1258570200",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Last year, at Devoxx 2008, an audience member posed a question in one of our sessions: how do traditional cartoon animation rules apply to our techniques of GUI animation for Filthy Rich Clients? This presentation is our long-winded answer. \n\nGUIs are not cartoons, but they share some of the same constraints: they are a visual medium, inherently 2D, and they must convey potentially complex information to the user in a very short amount of time. A confused user is an unhappy user, so the clearer we can make our GUIs to our users, the more productive they will be in using the applications we build. \n\nIn the 1920s through the 1940s, animators at Disney Studios studied motion in real life in order to come up with what they called the \"Twelve Rules\" of animation, for providing more lifelike and enjoyable cartoons. We examine each of these rules to see how we can apply the same techniques to GUI animations to create better and more enjoyable user experiences.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Animation+Rules"
    },
    {
        "sessionspeakers": "Koen Van Exem",
        "fulllink": "http://www.devoxx.com/display/DV09/Dimensional+Planning",
        "room": "6",
        "tags": "Methodology",
        "track": "Conference",
        "unixstart": "1258566600",
        "sessiontitle": "Dimensional Planning",
        "datetime": "17:50-18:50",
        "unixend": "1258570200",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Dimensional Planning is a technique that introduces depth as an extra dimension to the classical iron triangle of time, scope and resources. Dimensional planning intensifies iterative development, a cornerstone of Agile Software Development. This intensified iterative development results in extra feedback loops and more adaptability, that in turn results in shorter time to market and building what's needed, not what was originally conceived. Adapting to change becomes manageable with Dimensional Planning. \n\nTopics Covered: \n\nThe difference between iterative and incremental development\n\nDirt, cobblestone and asphalt road as a metaphor for the depth dimension\n\nApplied at the feature (depths )and feature group (alternate futures) level\n\nFunctional and non-functional dimensions\n\nDemonstrate the economical benefits (Lean and Theory of Constraints)\n\nIn combination with Scrum and Kanban/Pull (and even as a stepping stone from waterfall to agile)",
        "sessionlink": "http://www.devoxx.com/display/DV09/Dimensional+Planning"
    },
    {
        "sessionspeakers": "Ivar Jacobson, Robert C. Martin",
        "fulllink": "null",
        "room": "8",
        "tags": "Keynotes",
        "track": "Conference",
        "unixstart": "1258623000",
        "sessiontitle": "Keynotes",
        "datetime": "9:30-11:30",
        "unixend": "1258630200",
        "sessiontime": "9:30-11:30",
        "sessionabstract": "Ivar Jacobson (50m)\n\nFilling The Professionalism Gap: Craftsmanship and Policy by Robert C. Martin (50m)\n\nTen years ago Extreme Programming, Agile Development, and Scrum shook the foundations of our industry. Our cherished beliefs were brought into question and turned inside out. The echoes of that revolution continue to resound. But now an even bigger tide has begun to turn. The Agile movement has helped software developers, testers, and business analysts to define their profession with unprecedented clarity. \"Craftsmanship\" is the watchword of the day. There is a ground swell of individual contributors who have decided that they want to be true professionals instead of technical laborers. They want authority over their workmanship, their disciplines, and their practices, and they are willing to take the corresponding responsibility. But is management ready for the tsunami of professionalism that's on the horizon?",
        "sessionlink": "null"
    },
    {
        "sessionspeakers": "Arjen Poutsma",
        "fulllink": "http://www.devoxx.com/display/DV09/Spring+Framework+3.0",
        "room": "8",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258632000",
        "sessiontitle": "Spring Framework 3.0",
        "datetime": "12:00-13:00",
        "unixend": "1258635600",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "With the Spring Framework 3.0 release, we are introducing further annotation-based configuration options, unified expression language support and comprehensive REST support. This talk discusses Spring as a modern Java 5 oriented application framework: covering the core component model, annotation-driven web MVC as well as platform integration.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Spring+Framework+3.0"
    },
    {
        "sessionspeakers": "Martijn Dashorst",
        "fulllink": "http://www.devoxx.com/display/DV09/Wicket+in+Action",
        "room": "5",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258632000",
        "sessiontitle": "Wicket in Action",
        "datetime": "12:00-13:00",
        "unixend": "1258635600",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "Apache Wicket is a component oriented Java web application framework that brings back object oriented programming to the Web. With just HTML and Java, Wicket gives designers and programmers a tool they can work together in. In this session you'll be introduced to Wicket's programming model, and we'll quickly go from simple components, form processing and providing feedback to integrating with Spring and Guice, securing, testing and deploying your application. A lot of ground to cover but the best way to learn everything you wanted to know about Wicket.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Wicket+in+Action"
    },
    {
        "sessionspeakers": "Michael Kay",
        "fulllink": "http://www.devoxx.com/display/DV09/Using+XML+with+Java",
        "room": "4",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258632000",
        "sessiontitle": "Using XML with Java",
        "datetime": "12:00-13:00",
        "unixend": "1258635600",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "Java developers wanting to read and write XML data are spoilt for choice: there's a whole range of interfaces available from SAX and DOM (and improved DOMs such as JDOM and XOM) through data binding tools and APIs to high-level declarative languages such as XSLT and XQuery. Yet the reality is that it's easy to get bogged down writing thousands of lines of code that do nothing other than translating data from one representation to another (and soaking up machine cycles while they do so). So it's important to choose the right tool for the job. This talk examines the options available and tries to help you make a choice. It also hazards some guesses about future directions that the technology might take. Should we all be waiting for something like LINQ, for example?",
        "sessionlink": "http://www.devoxx.com/display/DV09/Using+XML+with+Java"
    },
    {
        "sessionspeakers": "Manik Surtani",
        "fulllink": "http://www.devoxx.com/display/DV09/Infinispan+and+the+future+of+data+grids",
        "room": "9",
        "tags": "JBoss Partner Slot",
        "track": "Conference",
        "unixstart": "1258632000",
        "sessiontitle": "Infinispan and the future of data grids",
        "datetime": "12:00-13:00",
        "unixend": "1258635600",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "\"In this talk, Infinispan founder and JBoss Cache project lead Manik Surtani introduces the role of data grids in today's cloud-computing environment. The extreme scalability offered by data grids are powering the greatest and most high-profile of today's applications, and data grids take on a far more prominent role in cloud deployments as traditional databases hit scalability and resilience issues. In his talk Surtani introduces Infinispan, the new open source data grid platform, and it's motivations and evolution as a project. Distributed data structures and the use of data grids as a viable, cloud-ready data storage mechanism will be discussed in depth.\"",
        "sessionlink": "http://www.devoxx.com/display/DV09/Infinispan+and+the+future+of+data+grids"
    },
    {
        "sessionspeakers": "Christophe Coenraets",
        "fulllink": "http://www.devoxx.com/display/DV09/Model-Driven+Development+Using+Adobe+Flash+Builder+4+and+LiveCycle+Data+Services+ES",
        "room": "6",
        "tags": "Adobe Partner Slot",
        "track": "Conference",
        "unixstart": "1258632000",
        "sessiontitle": "Model-Driven Development Using Adobe Flash Builder 4 and LiveCycle Data Services ES",
        "datetime": "12:00-13:00",
        "unixend": "1258635600",
        "sessiontime": "12:00-13:00",
        "sessionabstract": "See how to build and maintain data-driven Flex applications with an unprecedented level of productivity and flexibility. In this session, we use Flash Builder together with Data Services to build a sophisticated, data-driven application from A to Z. You focus on your data model: The client and server side of your application are created and kept in sync for you automatically. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Model-Driven+Development+Using+Adobe+Flash+Builder+4+and+LiveCycle+Data+Services+ES"
    },
    {
        "sessionspeakers": "Stephen Chin",
        "fulllink": "http://www.devoxx.com/display/DV09/Pro+JavaFX+-+Developing+Enterprise+Applications",
        "room": "8",
        "tags": "RIA",
        "track": "Conference",
        "unixstart": "1258639200",
        "sessiontitle": "Pro JavaFX - Developing Enterprise Applications",
        "datetime": "14:00-15:00",
        "unixend": "1258642800",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "You have probably heard about JavaFX, and seen some very impressive demos of its graphics, animation, and multimedia capabilities. While there is nothing wrong with glitter and eye candy, this presentation will dig deeper to show how you can build full-featured applications with JavaFX today.\n\nWhat you will get is a down-and-dirty, hands-on guide to building real JavaFX enterprise applications. This includes using controls and layouts to quickly prototype a profressional UI, seamless web service communication with your back-end server, integrating with existing web applications, and deploying an easily maintainable application to the web, desktop, and mobile.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Pro+JavaFX+-+Developing+Enterprise+Applications"
    },
    {
        "sessionspeakers": "Kirk Pepperdine, Dan Hardiker",
        "fulllink": "http://www.devoxx.com/display/DV09/The+not+so+dark+art+of+Performance+Tuning",
        "room": "5",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258639200",
        "sessiontitle": "The not so dark art of Performance Tuning",
        "datetime": "14:00-15:00",
        "unixend": "1258642800",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "That performance tuning is still considered to be a dart art is attributable to the lack of understanding of performance tuning best practices. In this talk Dan, our typically developer, will go bumbling off in an attempt to tune a poorly performing application. During the process we will introduce a number of best practices that could have helped him reach his performance goals, without the need of magic.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+not+so+dark+art+of+Performance+Tuning"
    },
    {
        "sessionspeakers": "Kevin Nilson",
        "fulllink": "http://www.devoxx.com/display/DV09/Scaling+CometD+to+the+Masses",
        "room": "4",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258639200",
        "sessiontitle": "Scaling CometD to the Masses",
        "datetime": "14:00-15:00",
        "unixend": "1258642800",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "CometD is an open source framework that supports writing comet applications using the popular Bayeux protocol. Comet, often called \"Reverse Ajax\", allows you to push data from the server to the browser. Comet has been slow to adopt because it has been plagued with scalability problems. Traditional web servers were plagued with one thread per request problems, which limited support to a few hundred clients per server. This problem has been solved by Asychronous Servlets standardized as part of Servlet 3.0. \n\nAsynchronous Servlets solved many of the major scalability problems, but CometD's original server implementation hid much of the internal information about what was going on inside the CometD server. Working with a closed box made scalability nearly impossible. Over time CometD has opened access to it's internals to help you \"Scale CometD to the Masses\". Many of these enhancements to CometD were suggested by speaker Kevin Nilson. In this session Kevin will walk you through recent enhancements to CometD and teach you how to \"Scale CometD to the Masses\".",
        "sessionlink": "http://www.devoxx.com/display/DV09/Scaling+CometD+to+the+Masses"
    },
    {
        "sessionspeakers": "Matthew Eernisse",
        "fulllink": "http://www.devoxx.com/display/DV09/Windmill",
        "room": "9",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258639200",
        "sessiontitle": "Windmill",
        "datetime": "14:00-15:00",
        "unixend": "1258642800",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "Windmill is a web testing tool designed to let you painlessly automate and debug your web application.\n\nOriginating at the Open Source Applications Foundation Windmill was built to help QA keep up with the rapid release cycles of the Chandler Server Web UI (Cosmo) project. As the Cosmo client is heavy in JavaScript and AJAX functionality, Windmill makes the communication between the service and the client code a priority.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Windmill"
    },
    {
        "sessionspeakers": "Nordin Haouari",
        "fulllink": "http://www.devoxx.com/display/DV09/Test-driven+development+in+Flex",
        "room": "6",
        "tags": "Cegeka Partner Slot",
        "track": "Conference",
        "unixstart": "1258639200",
        "sessiontitle": "Test-driven development in Flex",
        "datetime": "14:00-15:00",
        "unixend": "1258642800",
        "sessiontime": "14:00-15:00",
        "sessionabstract": "How do you apply agile engineering practices when building an application with a Flex front-end? Nordin will demonstrate how to implement user stories taking a test-first approach and how to set up a continuous build.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Test-driven+development+in+Flex"
    },
    {
        "sessionspeakers": "Patrick Chanezon, Guillaume Laforge",
        "fulllink": "http://www.devoxx.com/display/DV09/Google+Appengine+Java+-+Groovy+baby",
        "room": "8",
        "tags": "Cloud",
        "track": "Conference",
        "unixstart": "1258643400",
        "sessiontitle": "Google Appengine Java - Groovy baby",
        "datetime": "15:10-16:10",
        "unixend": "1258647000",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Introduced in April 2009, and made available to all developers last june, Google Appengine Java allows developers to leverage Google's cloud infrastructure to run their Java applications. With the Google Eclipse Plugin, as often demoed, it takes 5 minutes to put a GWT/GAE Java \"Hello World\" application in production: this talk will be about what can you do after these first 5 minutes of total bliss \n\nPatrick will cover Appengine Java's APIs, including recent features like XMPP and Task Queues, tools integration, limitations, how to run other JVM based languages used in the wild (Groovy, JRuby, Scala, Javascript), and show cool apps that have been developed with appengine.\n\nGuillaume will present Gaelyk, a lightweight toolkit for easily developing applications in Groovy to be deployed on Google App Engine Java. We'll learn more about what the toolkit provides, how to leverage it for your own needs through some demos.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Google+Appengine+Java+-+Groovy+baby"
    },
    {
        "sessionspeakers": "Joe Nuxoll, Tor Norbye, Carl Quinn, Dick Wall",
        "fulllink": "http://www.devoxx.com/display/DV09/The+JavaPosse.com+Live",
        "room": "5",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258643400",
        "sessiontitle": "The JavaPosse.com Live",
        "datetime": "15:10-16:10",
        "unixend": "1258647000",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "Live recording of the JavaPosse.com podcast.",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+JavaPosse.com+Live"
    },
    {
        "sessionspeakers": "Mark Halvorson",
        "fulllink": "http://www.devoxx.com/display/DV09/Development+is+Social",
        "room": "4",
        "tags": "Atlassian Partner Slot",
        "track": "Conference",
        "unixstart": "1258643400",
        "sessiontitle": "Development is Social",
        "datetime": "15:10-16:10",
        "unixend": "1258647000",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "One might think sitting at your desk coding is the exact opposite of a \"social activity\". With OpenSocial - software development can be seen as the most social thing you will ever do. So poke your friends, chuck some sheep and come to this presentation to learn how commits, code review, and software documentation can turn you into the life of the party.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Development+is+Social"
    },
    {
        "sessionspeakers": "Ross Mason",
        "fulllink": "http://www.devoxx.com/display/DV09/iBeans+-+dead+simple+integration+for+the+Web",
        "room": "9",
        "tags": "SOA",
        "track": "Conference",
        "unixstart": "1258643400",
        "sessiontitle": "iBeans - dead simple integration for the Web",
        "datetime": "15:10-16:10",
        "unixend": "1258647000",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "What will be covered \nMany web applications need integration capabilities but don't want to build an ESB solution. Typically, they want a simple solution for performing common integration tasks such as receiving and sending messages over Email, JMS or calling a Web Service. This talk will cover some options available that greatly reduce the amount of code and effort for performing these tasks without introducing new complexities or architecture considerations using new framework - iBeans.\n\nWho should attend this session: \n- Java Web Application developers who need very simple integration and routing options without the hassle.\n- Developers who don't really care about SOA but need to build service oriented applications.\n- Developers who want to talk to public services like Twitter, Gmail or Flickr\n\nWhat problem(s)/challenge(s) will an attendee learn to solve by attending your session? \nThis session will teach the audience how to integrate their web applications with other applications and services on the web and the enterprise in a way that doesn't add complexity to the code or architecture of the application. Using a couple of simple constructs developers will be able to integrate with services such as Twitter, Google Maps and Gmail in minutes.",
        "sessionlink": "http://www.devoxx.com/display/DV09/iBeans+-+dead+simple+integration+for+the+Web"
    },
    {
        "sessionspeakers": "George Maggessy, Maiko Rocha",
        "fulllink": "http://www.devoxx.com/display/DV09/How+we+rebuild+Y+Mail+and+Facebook+using+JSF",
        "room": "6",
        "tags": "Oracle Partner Slot",
        "track": "Conference",
        "unixstart": "1258643400",
        "sessiontitle": "How we rebuild Y Mail and Facebook using JSF",
        "datetime": "15:10-16:10",
        "unixend": "1258647000",
        "sessiontime": "15:10-16:10",
        "sessionabstract": "JSF is the current Java standard for building web UIs, but its reception and adoption by the Java community has been mixed. In this presentation we will take a look at the building blocks of JSF and how to push the boundaries of the provided UI components and layout managers to rebuild two well known websites from scratch: Yahoo! Mail and Facebook. We will discuss challenges, limitations, and advantages of using JSF that were found along the development process.",
        "sessionlink": "http://www.devoxx.com/display/DV09/How+we+rebuild+Y+Mail+and+Facebook+using+JSF"
    },
    {
        "sessionspeakers": "Michael Ernst",
        "fulllink": "http://www.devoxx.com/display/DV09/Detecting+and+preventing+bugs+with+pluggable+type-checking",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258648800",
        "sessiontitle": "Detecting and preventing bugs with pluggable type-checking",
        "datetime": "16:40-17:40",
        "unixend": "1258652400",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Are you tired of null pointer exceptions, unintended side effects, SQL injections, concurrency errors, mistaken equality tests, and other run-time errors that appear during testing or in the field? A pluggable type system can guarantee the absence of these errors, and many more.\n\nThis talk describes a set of pluggable type checkers that operate as annotation processors for javac. The type checkers are easy to use (for example, the syntax is much less verbose than generics) and have found many errors in real programs. Java 7 will contain syntactic support for type annotations, but in the meanwhile your code remains backward-compatible with all versions of Java.\n\nThe talk also describes the Checker Framework, which enables a programmer to write an annotation processors that checks custom properties of your code and prevents even more bugs. The talk will demonstrate the tools in action.\n\nThe type-checkers and the Checker Framework are publicly available at http://types.cs.washington.edu/jsr308/",
        "sessionlink": "http://www.devoxx.com/display/DV09/Detecting+and+preventing+bugs+with+pluggable+type-checking"
    },
    {
        "sessionspeakers": "Roger Kitain",
        "fulllink": "http://www.devoxx.com/display/DV09/Enhancing+the+JavaServer+Faces+2.0+Component+Model",
        "room": "5",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258648800",
        "sessiontitle": "Enhancing the JavaServer Faces 2.0 Component Model",
        "datetime": "16:40-17:40",
        "unixend": "1258652400",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "The JavaServer Faces 2.0 specification offers a flexible, light weight model for creating sophisticated components for the web. But did you know that this model can be enhanced easily by adding new \"behavior\"?\n\nIn this comprehensive session, we will:\n- explore how to create JSF 2.0 components.\n- explore how to enhance the JSF 2.0 component model by leveraging the new \"behavior\" model.\n- see ho we can create tool tips, client side validation and leverage 3rd party JavaScript libraries with JSF 2.0 components.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Enhancing+the+JavaServer+Faces+2.0+Component+Model"
    },
    {
        "sessionspeakers": "Dick Wall",
        "fulllink": "http://www.devoxx.com/display/DV09/Funky+Java%2C+Objective+Scala",
        "room": "4",
        "tags": "JavaSE",
        "track": "Conference",
        "unixstart": "1258648800",
        "sessiontitle": "Funky Java, Objective Scala",
        "datetime": "16:40-17:40",
        "unixend": "1258652400",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "Polyglot programming is here, and can improve your style. Suggestions on how to inject a little more functional style into your Java, and temper Scala with a mix of Object Oriented and Functional style.\n\nRecently, while the Java platform has been going from strength to strength, improving both performance and support for alternative languages, the Java language has started to appear less exciting than many of the alternatives that now run on the JVM. There is a lot to be said for the modern features of many of these new alternatives, but does that mean the fat lady has sung for Java?\n\nNot so, while we might still not have closures or properties, there are many new and interesting libraries and techniques that can breathe new life and style into your Java source. A stronger emphasis on immutable value objects, use of third party libraries like the Google collections library, DSL like fluent interfaces and more radical ideas like Project Lombok can all help you improve your style, reduce the boilerplate, reduce errors and be more productive with Java. It will bring fun back to your Java development.\n\nThe first part of this session will look at libraries and techniques that you can use with today's Java 6, and a peek ahead to Java 7.\n\nTopics covered will include:\nImmutable value classes \nBuilder pattern and fluent APIs \nTypesafe \"Multiple returns\" with Pairs and Triples \nPredicates, functions, constraints, identity maps and more with the Google Collections Library\n\nAt the same time, alternative languages that offer much more than Java are emerging on the JVM. Scala is one interesting option that offers static typing but with the same reduction of boilerplate and incidental complexity as many dynamically typed languages. Scala has a strong functional heritage, but also excellent support for Object Orientation, a fact that can greatly ease the transition to this new language. By starting with a mix of OO and Functional, the learning curve is lowered and the results are immediate.\n\nIn the second part of this session we will look at Scala, it similarities to Java, and it's easy access improvements. Along the way, some functional techniques will be introduced where they make sense, and where they make life easier. This is intended to be like easing into a warm swimming pool rather than diving in cold at the deep end.\n\nAimed at beginner and intermediate developers, this session aims to help you improve your productivity and coding style.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Funky+Java%2C+Objective+Scala"
    },
    {
        "sessionspeakers": "Ludovic Champenois, Roberto Chinnici",
        "fulllink": "http://www.devoxx.com/display/DV09/Deep+dive+on+the+Java+EE+6+platform+with+GlassFish+V3",
        "room": "9",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258648800",
        "sessiontitle": "Deep dive on the Java EE 6 platform with GlassFish V3",
        "datetime": "16:40-17:40",
        "unixend": "1258652400",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "This session will offer an in-depth look at some of the new functionality in the Java EE 6 platform, tying it to new features in GlassFish V3. We'll explain how features such as profiles and pluggability are rooted at the implementation level in the modularity of GlassFish V3, in itself based on OSGi, and how this benefits Java EE developers. \n\nWe'll highlight all the extensibility contracts that are part of Java EE 6, showing how they are relevant to application developers. We'll look at things like: pluggability in the web container, portable extensions in CDI (JSR-299), support for scripting languages, use of OSGi services in GlassFish and more. Finally, we'll address tool integration (including the admin console and the CLI) and the importance of features such as fast redeployment and session preservation across deployments to maximize productivity.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Deep+dive+on+the+Java+EE+6+platform+with+GlassFish+V3"
    },
    {
        "sessionspeakers": "Simon Ritter",
        "fulllink": "http://www.devoxx.com/display/DV09/Using+BTrace+and+DTrace+to+Instrument+and+Analyse+Java+Applications",
        "room": "6",
        "tags": "Sun Partner Slot",
        "track": "Conference",
        "unixstart": "1258648800",
        "sessiontitle": "Using BTrace and DTrace to Instrument and Analyse Java Applications",
        "datetime": "16:40-17:40",
        "unixend": "1258652400",
        "sessiontime": "16:40-17:40",
        "sessionabstract": "BTrace is a tool that lets you perform dynamic instrumentation of Java applications, in that respect it's similar to DTrace. However, DTrace depends on the underlying platform whereas BTrace works on all platforms with Java support. In this session we will start with a quick introduction to BTrace and then look at how to use BTrace to track down performance issues that otherwise might be hard to solve.\n\nFor more detailed investigation of how Java applications areinteracting with the underlying OS DTrace has no equal. This session will also look at how to use DTrace on Solaris machines and give examples of how support in the virtual machine can be expanded by adding your own probes to application code.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Using+BTrace+and+DTrace+to+Instrument+and+Analyse+Java+Applications"
    },
    {
        "sessionspeakers": "Mark Reinhold",
        "fulllink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753089",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258653000",
        "sessiontitle": "The Modular Java Platform & Project Jigsaw",
        "datetime": "17:50-18:50",
        "unixend": "1258656600",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "The future of the Java Platform � and of applications � is modular. A modular Java runtime will enable shorter downloads, smaller installations, and faster startup. Modular applications will share these benefits; they'll also be simpler to construct and maintain as well as easier to integrate with native operating systems. \n\nThis session will describe the design of the module system being developed in Project Jigsaw, demonstrate its key features, and show how it's being used to modularize the platform.",
        "sessionlink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753089"
    },
    {
        "sessionspeakers": "Romain Guy",
        "fulllink": "http://www.devoxx.com/display/DV09/Android+-+resolution+independence+and+high+performance+graphics",
        "room": "5",
        "tags": "Mobile",
        "track": "Conference",
        "unixstart": "1258653000",
        "sessiontitle": "Android - resolution independence and high performance graphics",
        "datetime": "17:50-18:50",
        "unixend": "1258656600",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Android is a mobile operating system designed to run on a wide variety of devices. By the end of the year, Android devices will exist in different screen resolutions and densities. In this session you will learn how Android copes with multiple resolutions and densities and how you can adapt your application. \n\nYou will also discover a new graphics technology developed for the \"Eclair\" branch of Android. This technology helps you easily write efficient visual effects and animations in your Android applications.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Android+-+resolution+independence+and+high+performance+graphics"
    },
    {
        "sessionspeakers": "Holly Cummins",
        "fulllink": "http://www.devoxx.com/display/DV09/Performance+for+the+performance-shy",
        "room": "4",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258653000",
        "sessiontitle": "Performance for the performance-shy",
        "datetime": "17:50-18:50",
        "unixend": "1258656600",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "No one likes slow applications, but sometimes it's hard to know where to start when trying to fix a performance problem. This talk will cover a range of tools and techniques which can be used to track down and fix performance issues.\n\nTopics covered:\n- Performance tuning - not just for performance geeks.\n- What's the garbage collector doing? (And why you should care.)\n- But why is the garbage collector doing all that, anyway? How to find out what's in your heap (tools discussed are applicable to most JVMs).\n- Are you waiting around on locks?\n- Is your application running the code it should be?\n- Solving problems you didn't even know existed with the Health Center (applicable IBM VMs).",
        "sessionlink": "http://www.devoxx.com/display/DV09/Performance+for+the+performance-shy"
    },
    {
        "sessionspeakers": "Jason van Zyl",
        "fulllink": "http://www.devoxx.com/display/DV09/Maven+Reloaded",
        "room": "9",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258653000",
        "sessiontitle": "Maven Reloaded",
        "datetime": "17:50-18:50",
        "unixend": "1258656600",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "Maven 3.0 will be the version Maven for the people. The Maven team has gone to the ends of the earth to ensure backward compatibility, improve usability, increase performance, allow safe embedding, and pave the way for implement many highly demanded features. This talk will briefly cover the process and tooling changes that have occured in the Maven project in order to accomplish what we have done with Maven 3.0, as well as discuss the architectural and feature changes. Some of the process changes include setting up a multi-platform Hudson grid, building out a framework of over 440 integration tests, creating integration tests for all core Maven plugins, and systematically seeking out Maven 2.x OSS projects to validate Maven 3.x's compatibility. We also built out a framework that measures disk I/O, network I/O, memory consumption, and CPU utilization to ensure that performance doesn't degrade.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Maven+Reloaded"
    },
    {
        "sessionspeakers": "Virgil Dodson",
        "fulllink": "http://www.devoxx.com/display/DV09/Introduction+to+BIRT+Reporting",
        "room": "6",
        "tags": "Birt Actuate",
        "track": "Conference",
        "unixstart": "1258653000",
        "sessiontitle": "Introduction to BIRT Reporting",
        "datetime": "17:50-18:50",
        "unixend": "1258656600",
        "sessiontime": "17:50-18:50",
        "sessionabstract": "This session will introduce the Eclipse open source BIRT (Business Intelligence and Reporting Tools) project and the various ways to integrate BIRT into applications. We will discuss and show several deployment options that range from API integration to integrating BIRT Viewers into web applications. Topics covered include using the BIRT Designer, the BIRT APIs, and working with the open source BIRT web viewer example. We will also look at a JavaScript API for embedding and controlling BIRT reports, using Flash charts and gadgets with BIRT reports, AJAX-based interactivity on BIRT reports, and a web-based BIRT designer for end users.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Introduction+to+BIRT+Reporting"
    },
    {
        "sessionspeakers": "Jasper Potts, Richard Bair",
        "fulllink": "http://www.devoxx.com/display/DV09/Gaming+JavaFX",
        "room": "8",
        "tags": "RIA",
        "track": "Conference",
        "unixstart": "1258709400",
        "sessiontitle": "Gaming JavaFX",
        "datetime": "9:30-10:30",
        "unixend": "1258713000",
        "sessiontime": "9:30-10:30",
        "sessionabstract": "Building graphically rich applications is fun! We dive right in with tips and tricks and lots of eye candy to show off the rich graphical capabilities of the JavaFX platform. JavaFX brings a fully hardware accelerated graphics stack, true 3D transforms and effects, an easy to write declarative programming language and powerful graphical APIs to allow you to write fun, compelling, consumer content. Come see how to have more fun creating your next application with JavaFX.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Gaming+JavaFX"
    },
    {
        "sessionspeakers": "Simon Ritter",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+and+JavaFX+Technology+and+the+Nintendo+Wiimote",
        "room": "5",
        "tags": "Sun Partner Slot",
        "track": "Conference",
        "unixstart": "1258709400",
        "sessiontitle": "Java and JavaFX Technology and the Nintendo Wiimote",
        "datetime": "9:30-10:30",
        "unixend": "1258713000",
        "sessiontime": "9:30-10:30",
        "sessionabstract": "The Nintendo Wii has changed the way many people perceive computer games, shifting from the traditional console to a more natural, physically interactive experience. To achieve this, the Wii includes an innovative remote control (or Wiimote). To provide control of an on-screen cursor, the Wiimote has a special camera that can track up to four points of infrared light and report their positions in real time.\n\nThis session explores how the Wiimote can be used in ways not originally intended by the Wii designers. Example applications keep the Wiimote stationary and use it to track moving infrared LEDs, which can be mounted on a pen, a screen, or even an umbrella. Data about the position of the infrared lights can be used to control the position of images so they are always projected on a screen or to provide a virtual whiteboard environment.\n\nThe demonstrations use JSR 82 (Java APIs for Blue-tooth), the WiiremoteJ open-source API, a Java platform library, and JavaFX code to drive the user interface. The session shows how JavaFX technology really is, \"for all the screens of your life\", including ones you've never thought of.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+and+JavaFX+Technology+and+the+Nintendo+Wiimote"
    },
    {
        "sessionspeakers": "Paul Brown",
        "fulllink": "http://www.devoxx.com/display/DV09/BPM+in+a+SOA+Environment",
        "room": "4",
        "tags": "SOA",
        "track": "Conference",
        "unixstart": "1258709400",
        "sessiontitle": "BPM in a SOA Environment",
        "datetime": "9:30-10:30",
        "unixend": "1258713000",
        "sessiontime": "9:30-10:30",
        "sessionabstract": "In a service-oriented architecture a business process management (BPM) engine is both a provider and consumer of services. BPM's consumed services generally provide access to the enterprise's applications, while its provided services define and manage business processes. These provided services are used by different types of interfaces and (potentially, at least) other services. This talk explores some of the common design patterns linking BPM engines, other services, interface components, and applications.\n\nWe begin by exploring the relationship between SOA and BPM. From the BPM engine perspective, it is tempting to consider other services to be passive providers of functionality that are called upon demand. However, this view is too narrow. Non-BPM services may notify business processes asynchronously when certain business events occur, with this notification serving to triggering activity within the BPM engine. Non-BPM services may also recognize that an event has occurred and initiate a BPM process via the services provided by the BPM engine.\n\nExploring this further, we realize that there are portions of every business process that cannot be managed by a BPM engine - in particular, the sequence of events that leads to the initiation of a BPM process. Many (if not most) business processes are not managed at all - they are \"hard wired\" in the form of a chain of communicating components.\n\nFrom the perspective of user (and other) interfaces, the BPM engine itself can be viewed as a service that defines and manages processes. Operations of this service create and modify process definitions, start and stop business processes, and interact with the individual activities of an executing business process.\n\nThe choice of patterns relating a user interface to a BPM engine depends upon which party (the user or the engine) assigns work and determines which task to perform next. We explore two different patterns covering what happens when a user completes one activity and begins another. We also explore the patterns that emerge when a user must interrupt one task and resume work on another.\n\nMost interfaces require access to information that is being managed by services other than the BPM engine. There are several interesting design patterns for this interaction depending upon whether requests for these other services are directed through the BPM engine or are invoked directly by the interface component. Some of these patterns require transactional integrity across multiple service operation invocations.",
        "sessionlink": "http://www.devoxx.com/display/DV09/BPM+in+a+SOA+Environment"
    },
    {
        "sessionspeakers": "Staffan Noteberg",
        "fulllink": "http://www.devoxx.com/display/DV09/Pomodoro+Technique",
        "room": "9",
        "tags": "Methodology",
        "track": "Conference",
        "unixstart": "1258709400",
        "sessiontitle": "Pomodoro Technique",
        "datetime": "9:30-10:30",
        "unixend": "1258713000",
        "sessiontime": "9:30-10:30",
        "sessionabstract": "You have so much you need to accomplish today. Your list is a mile long and you find yourself getting interrupted every other minute. You'd like to tell everyone to leave you alone, but most of the interruptions are coming from you! You think of a phone call you need to make or a web site you need to check and before you know it you're answering email, checking twitter, and finding a million other things to occupy your time.\n\nYou need to focus - really focus.\n\nThe Pomodoro Technique puts you back in charge of your day. You'll apply successful techniques from software engineering to identify what you should be doing today and to help you achieve your goals. Your mind won't wander when it is fully engaged in short bursts of focused activity.\n\nLearn to work less and accomplish more using nothing more than paper, pencil, and a simple kitchen timer.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Pomodoro+Technique"
    },
    {
        "sessionspeakers": "Brian Goetz, Alex Buckley",
        "fulllink": "http://www.devoxx.com/display/DV09/Towards+A+Universal+VM",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258713000",
        "sessiontitle": "Towards A Universal VM",
        "datetime": "10:30-11:30",
        "unixend": "1258716600",
        "sessiontime": "10:30-11:30",
        "sessionabstract": "The success of the Java platform is powered by the Java Virtual Machine (JVM), which many people assume is tied to the Java programming language. In fact, 100+ programming languages are hosted on the JVM, including JavaFX, JRuby, Jython, Groovy, Clojure, and Scala. A key implementation challenge is to make code written in non-Java languages run as fast as code written in the Java language.\n\nThis talk looks at how the design of the JVM is evolving to improve performance of all languages. It explains new features like the invokedynamic bytecode - intended for the next release of the Java SE platform - that let language implementers fully realize the power of the JVM.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Towards+A+Universal+VM"
    },
    {
        "sessionspeakers": "Andy Wilkinson",
        "fulllink": "http://www.devoxx.com/display/DV09/Modular+Web+Applications+with+OSGi",
        "room": "5",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258713000",
        "sessiontitle": "Modular Web Applications with OSGi",
        "datetime": "10:30-11:30",
        "unixend": "1258716600",
        "sessiontime": "10:30-11:30",
        "sessionabstract": "Enterprise Java development is being revolutionised by the use of OSGi. The improved support for building modular applications, and the ability to dynamically add, remove, and replace functionality at runtime is presenting fresh opportunities and challenges to developers.\n\nIn this session we will look at the current state-of-the-art for modular Web applications with OSGi and in a series of live demonstrations, show that truly modular Web applications are now a reality.\n\nAttendees should have an understanding of OSGi basics and be familiar with Java Servlets.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Modular+Web+Applications+with+OSGi"
    },
    {
        "sessionspeakers": "Simon Ritter",
        "fulllink": "http://www.devoxx.com/display/DV09/Managing+Glassfish+on+OpenSolaris",
        "room": "4",
        "tags": "Sun Partner Slot",
        "track": "Conference",
        "unixstart": "1258713000",
        "sessiontitle": "Managing Glassfish on OpenSolaris",
        "datetime": "10:30-11:30",
        "unixend": "1258716600",
        "sessiontime": "10:30-11:30",
        "sessionabstract": "Application servers are the workhorse of today's' enterprises. However setting, installing, configuring and monitoring application servers are tedious and fraught with errors. In this session we will show how to use Open Solaris features to monitor, provision and backup Sun's Glassfish Application Server.\n\nAn example is using ZFS to host the domain directory for a GF domain, that would allow you to take a snapshot of your working configuration prior to an upgrade of your application and very easily and quickly go back to the previous version in case the upgrade failed. The same method can be used for backups and recovery. You could even put your disaster recovery image on a cloud storage eg. Amazon S3 or similar.\n\nSecurity separation of different components usually means that we will have to use multiple systems or multiple VMs on the same system. Using OpenSolaris, Containers and Crossbow network virtualization, we can build a systems that have security separation between each component, but still only use one physical system and just one kernel, thus, no VM overhead.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Managing+Glassfish+on+OpenSolaris"
    },
    {
        "sessionspeakers": "Howard Lewis Ship",
        "fulllink": "http://www.devoxx.com/display/DV09/Tapestry+5",
        "room": "9",
        "tags": "Web",
        "track": "Conference",
        "unixstart": "1258713000",
        "sessiontitle": "Tapestry 5",
        "datetime": "10:30-11:30",
        "unixend": "1258716600",
        "sessiontime": "10:30-11:30",
        "sessionabstract": "The Apache Tapestry web framework has been making a name for itself in terms of innovative features and ease of use. \n\nIn this session, we'll introduce Tapestry and explain its innovative approach to building fast, complex, reliable applications from simple and reusable components. Along the way, we'll demonstrate the features that make Tapestry so fun and productive: including live class reloading and convention over configuration: we'll show how these result in minute amounts of code to accomplish big goals, and how Tapestry brings scripting language productivity within reach of Java developers without sacrificing any of Java's inherent speed and power.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Tapestry+5"
    },
    {
        "sessionspeakers": "Don Brown",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Web+on+OSGi",
        "room": "8",
        "tags": "Java",
        "track": "Conference",
        "unixstart": "1258716600",
        "sessiontitle": "The Web on OSGi",
        "datetime": "11:30-12:30",
        "unixend": "1258720200",
        "sessiontime": "11:30-12:30",
        "sessionabstract": "Enterprise Web applications tend to grow like weeds in monolithic complexity. OSGi, although more often associated with Java technology-based clients and application servers, can bring a new level of modularity, uptime, and stability that is needed with today's always-on hosted Web applications. OSGi gets really interesting when the pretty architecture diagrams meet the real world, because it consists of various deployment platforms, development environments, and application architectures. This presentation, for Java 2 Platform, Enterprise Edition (J2EE platform)-savvy architects and senior developers, provides a practical guide to the Web on OSGi, from integration approach to bundle development, to real-world code you can use today.\n\nThe session discusses \n- What benefits OSGi brings to the J2EE platform \n- Three integration strategies \n- How to use Spring DM and Maven to ease development \n- Lessons learned from Atlassian's recent OSGi deployment \n- A production-ready example to use immediately",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Web+on+OSGi"
    },
    {
        "sessionspeakers": "Remco Blom",
        "fulllink": "http://www.devoxx.com/display/DV09/ArchiMate",
        "room": "5",
        "tags": "Enterprise",
        "track": "Conference",
        "unixstart": "1258716600",
        "sessiontitle": "ArchiMate",
        "datetime": "11:30-12:30",
        "unixend": "1258720200",
        "sessiontime": "11:30-12:30",
        "sessionabstract": "ArchiMate is the open standard modelling language for Enterprise Architecture, maintained by The Open Group. Learn in this presentation about enterprise architecture and the core components of a complete EA approach. We focus on the common language for enterprise architecture, why this is a necessity and how it relates to TOGAF. After explaining the most important concepts and relations, we will present various views which can be generated from the model repository based on a short case study. The presentation ends with real life examples and tips regarding the implementation of ArchiMate.",
        "sessionlink": "http://www.devoxx.com/display/DV09/ArchiMate"
    },
    {
        "sessionspeakers": "Roel Spilker, Reinier Zwitserloot",
        "fulllink": "http://www.devoxx.com/display/DV09/Project+Lombok",
        "room": "4",
        "tags": "JavaSE",
        "track": "Conference",
        "unixstart": "1258716600",
        "sessiontitle": "Project Lombok",
        "datetime": "11:30-12:30",
        "unixend": "1258720200",
        "sessiontime": "11:30-12:30",
        "sessionabstract": "In this presentation, the developers of lombok, Reinier Zwitserloot and Roel Spilker, will show the audience what lombok is about, and how you can use it to eliminate boilerplate from your java code. For example, instead of writing out common boilerplate such as getters, setters, toString, equals, and hashCode implementations, you can use lombok's @Data annotation. Lombok hooks into your compiler and IDE so that their interpretation of your source includes these methods, while you never actually see any of them in your editor. For IDEs, this means that you get all the benefits, such as auto-completion, the methods show up in your outline views, and search tools such as 'go to declaration'continue to work. While most IDEs offer a feature to generate the boilerplate, this is little help when reading the resulting code, and such code is much harder to maintain.\n\nDuring this presentation, all current lombok transformations will be showcased, including not just the aforementioned @Data annotation, but also lombok's Automatic Resource Management mechanism.\n\nAs the authors, we'll also discuss where we are heading with project lombok, including glimpses into the kinds of code you can write in the future.\n\nDepending on how many transformations lombok will support by November, and the number of future features suitable for inclusion in the talk, we'll take the audience through the process of building your own lombok extension, by writing on-stage the \"@Main\" transformation to generate the 'public static void main' method that creates a new instance and then calls the annotated instance method, explaining what we're doing as we go along.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Project+Lombok"
    },
    {
        "sessionspeakers": "Rob Davies, James Strachan",
        "fulllink": "http://www.devoxx.com/display/DV09/Open+Source+SOA+with+Fuse",
        "room": "9",
        "tags": "SOA",
        "track": "Conference",
        "unixstart": "1258716600",
        "sessiontitle": "Open Source SOA with Fuse",
        "datetime": "11:30-12:30",
        "unixend": "1258720200",
        "sessiontime": "11:30-12:30",
        "sessionabstract": "Fuse components are based on Apache SOA projects, and are integrated, tested and supported to combine the speed and innovation of open source software with the reliability and expertise of commercially provided enterprise services. This talk will give you an overview of what exactly Fuse stands for.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Open+Source+SOA+with+Fuse"
    },
    {
        "sessionspeakers": "Toni Menzel",
        "fulllink": "http://www.devoxx.com/display/DV09/OSGi+Testing+-+Pax+Exam",
        "room": "8",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258551000",
        "sessiontitle": "OSGi Testing - Pax Exam",
        "datetime": "13:30-13:45",
        "unixend": "1258551900",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "OSGi goes Enterprise but due to dynamic nature of OSGi, testing is hard. \nPax Exam, developed at OPS4J.org under the ASL 2.0 License, was built to simplify this a lot.",
        "sessionlink": "http://www.devoxx.com/display/DV09/OSGi+Testing+-+Pax+Exam"
    },
    {
        "sessionspeakers": "Roman Strobl",
        "fulllink": "http://www.devoxx.com/display/DV09/Tips+and+Tricks+for+Using+IntelliJ+IDEA",
        "room": "5",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258551000",
        "sessiontitle": "Tips and Tricks for Using IntelliJ IDEA",
        "datetime": "13:30-13:45",
        "unixend": "1258551900",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "This session is a demo full of tips and tricks for using IntelliJ IDEA 9. Developers will discover many keyboard shortcuts and features that will increase their productivity. We will focus on features which are a bit harder to find, but rewarding. We'll also look at using different advanced refactorings and inspections to improve code quality.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Tips+and+Tricks+for+Using+IntelliJ+IDEA"
    },
    {
        "sessionspeakers": "Angelo van der Sijpt, Xander Tamminga",
        "fulllink": "http://www.devoxx.com/pages/viewpage.action?pageId=2752619",
        "room": "4",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258551000",
        "sessiontitle": "Swing & OSGi - please play nice",
        "datetime": "13:30-13:45",
        "unixend": "1258551900",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "The dynamic nature of OSGi and the static nature of Swing do not play nice together. How do you make them both behave well, and end up with a dynamic, Swing-based application?",
        "sessionlink": "http://www.devoxx.com/pages/viewpage.action?pageId=2752619"
    },
    {
        "sessionspeakers": "Peter Pilgrim",
        "fulllink": "http://www.devoxx.com/display/DV09/XenonDataGrid+Open+Source+JavaFX+Table+Component",
        "room": "9",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258551000",
        "sessiontitle": "XenonDataGrid Open Source JavaFX Table Component",
        "datetime": "13:30-13:45",
        "unixend": "1258551900",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "In this brief presentation, I will talk about the XenonDataGrid JavaFX component that I have been building over the Summer of 2009. The XenonDataGrid is a table component, displays data in rows and columns. It is comparable to Swing's JTable component except that XDG is purely developed in JavaFX, and therefore uses the scenegraph for rendering rather than calling directly Java 2D immediate mode API. XenonDataGrid is part of the Nelson FX project , which I open sourced on Project Kenai shortly after JavaOne 2009.\n\nIn this presentation, you can expect:\n\n- To see a demonstration of the latest Milestone release support editing, validation and data adapters.\n- To hear about important design decisions. Why I separated of the renderable layer model from the table model.\n- Illustration of the table component's essential design: Composition Layers. Layers can be contain other layers.\n- A quick explanation of the Data Adapter classes that enable you to use the XDG in your own application, I will list several JavaFX mixin pure types that application developers can extend.\n- Brief overview of the supplied implementations of selection and layout algorithms (fixed dimension and proportional layouts)\n- An outline the essential pros and cons of JavaFX component development\n- The future plans for the JavaFX component\n\nSee my other AudioBoo: Five Recommendations for JavaFX Table UI Component.",
        "sessionlink": "http://www.devoxx.com/display/DV09/XenonDataGrid+Open+Source+JavaFX+Table+Component"
    },
    {
        "sessionspeakers": "Robin Fernandes",
        "fulllink": "http://www.devoxx.com/display/DV09/PHP+on+Java+-+the+Best+of+Both+Worlds",
        "room": "6",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258551000",
        "sessiontitle": "PHP on Java - the Best of Both Worlds",
        "datetime": "13:30-13:45",
        "unixend": "1258551900",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "PHP is an extremely popular language with a growing community of over 3 million developers. It powers more than 20 million domains, including hugely popular sites like Facebook and Wikipedia. As a proven technology with a large skill base, PHP is quickly making its way into new areas, where integration with existing assets is essential. In this talk, we'll see how technologies like P8, the PHP engine that is included in IBM WebSphere sMash, can help by running PHP code directly on the JVM. We will cover the new possibilities this entails (such as seamless integration between PHP and Java or even Groovy code) and some of the technical challenges involved in implementing support for PHP on the JVM.",
        "sessionlink": "http://www.devoxx.com/display/DV09/PHP+on+Java+-+the+Best+of+Both+Worlds"
    },
    {
        "sessionspeakers": "Scala Enthusiasts, Bill Venners",
        "fulllink": "http://www.devoxx.com/display/DV09/Scala+Enthusiasts",
        "room": "1",
        "tags": "Java++",
        "track": "BOFs",
        "unixstart": "1258570800",
        "sessiontitle": "Scala Enthusiasts",
        "datetime": "19:00-20:00",
        "unixend": "1258574400",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "Informal Scala enthusiasts gathering.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Scala+Enthusiasts"
    },
    {
        "sessionspeakers": "JUGs, James Gosling",
        "fulllink": "http://www.devoxx.com/display/DV09/Java+User+Group+BOF",
        "room": "2",
        "tags": "Community",
        "track": "BOFs",
        "unixstart": "1258570800",
        "sessiontitle": "Java User Group BOF",
        "datetime": "19:00-20:00",
        "unixend": "1258574400",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "Close to 50 Java User Groups are represented at Devoxx, so it goes without saying that we'll have our JUG networking BOF again this year",
        "sessionlink": "http://www.devoxx.com/display/DV09/Java+User+Group+BOF"
    },
    {
        "sessionspeakers": "Dror Bereznitsky, Fred Simon",
        "fulllink": "http://www.devoxx.com/display/DV09/Fan+on+the+JVM",
        "room": "1",
        "tags": "Java++",
        "track": "BOFs",
        "unixstart": "1258574400",
        "sessiontitle": "Fan on the JVM",
        "datetime": "20:00-21:00",
        "unixend": "1258578000",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Fan is a statically type language, with ease of dynamic which run on the JVM and the CLR. Fan has a clean and simple syntax, with powerful features, that give developers high productivity with the advantages of static typing.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Fan+on+the+JVM"
    },
    {
        "sessionspeakers": "Mark Reinhold, Brian Goetz, Alex Buckley",
        "fulllink": "http://www.devoxx.com/display/DV09/Update+JDK7",
        "room": "2",
        "tags": "Java",
        "track": "BOFs",
        "unixstart": "1258574400",
        "sessiontitle": "Update JDK7",
        "datetime": "20:00-21:00",
        "unixend": "1258578000",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Informal session with Sun engineers on JDK7.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Update+JDK7"
    },
    {
        "sessionspeakers": "Mario Fusco",
        "fulllink": "http://www.devoxx.com/display/DV09/No+more+loops+with+lambdaj",
        "room": "1",
        "tags": "Java++",
        "track": "BOFs",
        "unixstart": "1258578000",
        "sessiontitle": "No more loops with lambdaj",
        "datetime": "21:00-22:00",
        "unixend": "1258581600",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "lambdaj is a thread-safe library of static methods. It provides an internal DSL that allows to manipulate (sort, filter, convert, aggregate and more) collections in a more readable and maintainable way without writing a single loop. The last lambdaj release also allows to define and use pseudo-closure in the same DSL style.",
        "sessionlink": "http://www.devoxx.com/display/DV09/No+more+loops+with+lambdaj"
    },
    {
        "sessionspeakers": "Jean-Francois Arcand, Hubert Iwaniuk",
        "fulllink": "http://www.devoxx.com/display/DV09/Grizzly+Servlet+Container",
        "room": "2",
        "tags": "Web",
        "track": "BOFs",
        "unixstart": "1258578000",
        "sessiontitle": "Grizzly Servlet Container: Chuck Norris loves it!",
        "datetime": "21:00-22:00",
        "unixend": "1258581600",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "In this session, we will first introduce the new GrizzlySC and show how to embed and extend using GrizzlyAdapter. Next we will add Asynchronous Request Processing (ARP) features to it using AsyncFilter. In two line we will add support for Ajax Push/Comet by deploying the Atmosphere Framework. Finally we will use the OSGi Http Service API to deploy in Felix, PAX and Equinox",
        "sessionlink": "http://www.devoxx.com/display/DV09/Grizzly+Servlet+Container"
    },
    {
        "sessionspeakers": "Stephan Janssen",
        "fulllink": "http://www.devoxx.com/display/DV09/Parleys.com+for+JUGs+%28and+others%29",
        "room": "1",
        "tags": "Community",
        "track": "BOFs",
        "unixstart": "1258657200",
        "sessiontitle": "Parleys.com for JUGs (and others)",
        "datetime": "19:00-20:00",
        "unixend": "1258660800",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "Stephan will demonstrate the latest version of the Parleys.com platform and show how Java User Groups and other organizations can make their content available on a dedicated space. In addition we'll show some very interesting new features that will be made available during the Devoxx launch... ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Parleys.com+for+JUGs+%28and+others%29"
    },
    {
        "sessionspeakers": "Jasper Potts, Richard Bair",
        "fulllink": "http://www.devoxx.com/display/DV09/JavaFX+Futures",
        "room": "2",
        "tags": "RIA",
        "track": "BOFs",
        "unixstart": "1258657200",
        "sessiontitle": "JavaFX Futures",
        "datetime": "19:00-20:00",
        "unixend": "1258660800",
        "sessiontime": "19:00-20:00",
        "sessionabstract": "JavaFX has tremendous potential as a client stack running on the Java platform for creating both consumer content and enterprise content. During this BOF, JavaFX leads will discuss the current state of JavaFX, future plans, platform goals, and general Q&A. Come with questions, leave with answers!",
        "sessionlink": "http://www.devoxx.com/display/DV09/JavaFX+Futures"
    },
    {
        "sessionspeakers": "Mark Reinhold",
        "fulllink": "http://www.devoxx.com/display/DV09/The+Modular+Java+Platform+and+Project+JigSaw",
        "room": "1",
        "tags": "Java",
        "track": "BOFs",
        "unixstart": "1258660800",
        "sessiontitle": "The Modular Java Platform and Project JigSaw",
        "datetime": "20:00-21:00",
        "unixend": "1258664400",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "Pending",
        "sessionlink": "http://www.devoxx.com/display/DV09/The+Modular+Java+Platform+and+Project+JigSaw"
    },
    {
        "sessionspeakers": "Remco Blom",
        "fulllink": "http://www.devoxx.com/display/DV09/Introduction+in+TOGAF+9",
        "room": "2",
        "tags": "Enterprise",
        "track": "BOFs",
        "unixstart": "1258660800",
        "sessiontitle": "Introduction in TOGAF 9",
        "datetime": "20:00-21:00",
        "unixend": "1258664400",
        "sessiontime": "20:00-21:00",
        "sessionabstract": "The Open Group Architecture Framework (TOGAF) is a framework for enterprise architecture which provides a comprehensive approach to the design, planning, implementation, and governance of an enterprise architecture. Currently this framework is evolving to a de-facto and well supported standard including certification and tools. TOGAF has been developed by the Architecture Forum of The Open Group and continuously evolved since the mid-1990's from a technical focused model to a broad EA approach in the recently released version 9. You will learn about the elements of TOGAF 9, the various domains that are covered and how this relates to other aspects of the organisation. We focus on the Architecture Development Method (ADM) as the main model in TOGAF.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Introduction+in+TOGAF+9"
    },
    {
        "sessionspeakers": "Jason van Zyl",
        "fulllink": "http://www.devoxx.com/display/DV09/Maven3+BOF",
        "room": "1",
        "tags": "Java",
        "track": "BOFs",
        "unixstart": "1258664400",
        "sessiontitle": "Maven3 BOF",
        "datetime": "21:00-22:00",
        "unixend": "1258668000",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "Informal session with the creator of Maven, Jason Van Zyl.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Maven3+BOF"
    },
    {
        "sessionspeakers": "Matthew Eernisse",
        "fulllink": "http://www.devoxx.com/display/DV09/Fleegix.js+JavaScript+Toolkit",
        "room": "2",
        "tags": "Web",
        "track": "BOFs",
        "unixstart": "1258664400",
        "sessiontitle": "Fleegix.js JavaScript Toolkit",
        "datetime": "21:00-22:00",
        "unixend": "1258668000",
        "sessiontime": "21:00-22:00",
        "sessionabstract": "Fleegix.js provides an extremely lightweight, cross-browser set of JavaScript tools for building dynamic Web-app UIs.\n\nUsing Fleegix.js doesn't require you to drink a bunch of toolkit Kool Aid, and the code doesn't try to turn JavaScript into Ruby, Java, C++, or any other language � the code is plain, ordinary, idiomatic JavaScript.\n\nIt will not turn you into a rock star, but it will help you kick JavaScript ass.\n\nFleegix.js is well tested in the major-market-share browsers � Firefox 1+, Internet Explorer 6+, and Safari 2+. It is licensed under the Apache License, Version 2. ",
        "sessionlink": "http://www.devoxx.com/display/DV09/Fleegix.js+JavaScript+Toolkit"
    },
    {
        "sessionspeakers": "Virgil Dodson",
        "fulllink": "http://www.devoxx.com/display/DV09/Mixing+Excel+and+Java",
        "room": " 8",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258637400",
        "sessiontitle": "Mixing Excel and Java",
        "datetime": "13:30-13:45",
        "unixend": "1258638300",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "This session will cover the various ways to utilize Excel files within Java applications including reading Excel data to producing rich Excel output. The tool used for this session is a free Excel read/write API. We will also show a free desktop-based spreadsheet report authoring tool.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Mixing+Excel+and+Java"
    },
    {
        "sessionspeakers": "Tareq Abedrabbo",
        "fulllink": "http://www.devoxx.com/display/DV09/Creating+easy+and+secure+SOAPful+Web+Services+with+the+Spring-WS+Grails+Plugin",
        "room": " 5",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258637400",
        "sessiontitle": "Creating easy and secure SOAPful Web Services with the Spring-WS Grails Plugin",
        "datetime": "13:30-13:45",
        "unixend": "1258638300",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "The Spring-WS Grails plugin aims to make creating contract-first, document oriented web services easy by bringing together the power and flexibility of the Spring-WS framework and Grails.\n\nThis talk will present how the Spring-WS plugin makes it super-easy to develop best-practice contract-first and secure web services, avoiding all the pitfalls of fragile and unreliable techniques such as code generation or auto exposure of service classes without sacrificing your productivity.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Creating+easy+and+secure+SOAPful+Web+Services+with+the+Spring-WS+Grails+Plugin"
    },
    {
        "sessionspeakers": "Zoe Slattery",
        "fulllink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753338",
        "room": " 4",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258637400",
        "sessiontitle": "OSGi for enterprise applications - is it interesting?",
        "datetime": "13:30-13:45",
        "unixend": "1258638300",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "In the enterprise space, OSGi has been heavily exploited inside the run-time and tooling infrastructure (for example inside IBM WebSphere since v6.1 and Eclipse since v3.0) as a modularity technology that simplifies developing an maintaining extensible infrastructure. These same attributes are equally valuable in the applications that run on these infrastructures but only recently has OSGi started to move up into the enterprise application layer. The new OSGi v4.2 release is the first with a focus on the enterprise; this session looks at the work of the proposed Apache Aries incubator which is implementing these specifications in open source to help with the adoption of OSGi in enterprise applications.",
        "sessionlink": "http://www.devoxx.com/pages/viewpage.action?pageId=2753338"
    },
    {
        "sessionspeakers": "Daniel Gazineu",
        "fulllink": "http://www.devoxx.com/display/DV09/Fluent+Validation+Framework%2C+a+DSL+for+validations+using+Fluent+Interfaces",
        "room": " 9",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258637400",
        "sessiontitle": "Fluent Validation Framework, a DSL for validations using Fluent Interfaces",
        "datetime": "13:30-13:45",
        "unixend": "1258638300",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "Fluent Validation Framework is an open-source JAVA project hosted at http://sourceforge.net/projects/fluval. It brings a Domain Specific Language (DSL) for validations using Fluent Interfaces.\n\nThis talk explains how the framework was built, which were the difficulties on defining and implementing a Domain Specific Language using Fluent Interfaces and why to use this approach. During the talk some concepts and techniques for designing Fluent Interfaces will be addressed.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Fluent+Validation+Framework%2C+a+DSL+for+validations+using+Fluent+Interfaces"
    },
    {
        "sessionspeakers": "Peter Muir",
        "fulllink": "http://www.devoxx.com/display/DV09/Portable+in-container+testing+with+Arquillian",
        "room": " 6",
        "tags": "Quicky",
        "track": "Quickies",
        "unixstart": "1258637400",
        "sessiontitle": "Portable in-container testing with Arquillian",
        "datetime": "13:30-13:45",
        "unixend": "1258638300",
        "sessiontime": "13:30-13:45",
        "sessionabstract": "This talk demonstrates Arquillian, an extension for TestNG and JUnit that packages groups of tests inside Java EE archives, then individually deploys and executes them inside a container. With a fluent API provided by ShrinkWrap to define packaging, this extension can be used to validate the behavior of managed and enterprise beans or POJOs that use enterprise services just as easily as writing a unit test. Tests can be run from an IDE using either a standalone or pluggable, in-container environment.",
        "sessionlink": "http://www.devoxx.com/display/DV09/Portable+in-container+testing+with+Arquillian"
    }
]