[{"speakerName": "Eric Steegmans", "speakerbio": "Eric Steegmans is a professor at the department of computer science of the K.U.Leuven. After a decade of research in compiler construction, he directed his research activities to the area of software engineering. Since the early nineties, his expertise is in object-oriented analysis, design and implementation. He is leading a small research group that experiments with new language concepts at different levels of abstraction. Since a few years, he is program director for the bachelor-master in informatics. He teaches basic courses on object-oriented programming in the bachelor informatics and the bachelor computer science. In the master programs, he is in charge of courses on object-oriented programming languages and on object-oriented analysis."}, {"speakerName": "John M Willis", "speakerbio": "John Willis has worked in the IT management industry for 30 years. He started as a tape operator on an IBM mainframe while working for his high school computer club, and began his professional career at Exxon as an IT infrastructure analyst. He is the founder of four successful startups over the past 20 years and is currently the CEO of his self-funded Zabovo Corp. Willis is known internationally for his IT Management and Cloud blog. He also has two podcast series on clouds called 'Cloud Cafe' and 'Cloud Droplets'. Willis is also the co-host of Redmonk's 'IT Management Guys' podcast series.Related LinksJohn M Willis Blog"}, {"speakerName": "Tom Baeyens", "speakerbio": "Tom Baeyens is the founder and lead developer of JBoss jBPM, an open source workflow, BPM and orchestration engine. He is an employee of Red Hat and participates in the Java Community Process."}, {"speakerName": "Joram Barrez", "speakerbio": "Joram Barrez is a Java/JEE software engineer who recently joined JBoss, a division of Red Hat, as a jBPM core developer. He is extremely passionate about anything related to BPM and workflow systems. Before JBoss, he provided jBPM consultancy for several companies on the Belgian market, so he brings a lot of practical jBPM and BPM experience to the jBPM project. Currently, he is leading the BPMN 2 effort within the jBPM project. Joram is also one of the the co-founders of the Belgium JBoss User Group (http://www.jbug.be/).Joram blogs about jBPM and workflow systems at http://www.jorambarrez.be/blog/"}, {"speakerName": "Olav Maassen", "speakerbio": "Olav Maassen is Chief Engineer at QNH, the Netherlands and has nine years experience in IT doing projects mainly for financial institutions. He is co-author of \"Applied Java Patterns\". His main interest is in helping teams develop software more effectively. Olav strives for continuous improvement both for himself as for those he works with."}, {"speakerName": "Christophe Coenraets", "speakerbio": "Christophe Coenraets is a technical evangelist for Adobe where he focuses on rich Internet applications and enterprise integration. He has been working on Flex since the early days of the product in 2003. In his previous role at Macromedia, Christophe worked on JRun, the company's J2EE application server. Before joining Macromedia, Christophe was managing Java and Internet applications evangelism at Sybase. Christophe has been a regular speaker at conferences worldwide for the last 15 years. He blogs at http://coenraets.org. "}, {"speakerName": "Chet Haase", "speakerbio": "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java."}, {"speakerName": "Chris Richardson", "speakerbio": "Chris Richardson is a developer and architect with over 20 years of experience. He is a Java Champion and the author of POJOs in Action, which describes how to build enterprise Java applications with POJOs and lightweight frameworks such as Spring and Hibernate. Chris is the founder of CloudFoundry.com and the Head of Cloud Computing at SpringSource, a division of VMware. He lives in Oakland, CA with his wife and three children."}, {"speakerName": "Dan Allen", "speakerbio": "Dan Allen is a passionate Java EE software developer, consultant, and author of Seam in Action with over eight years of development experience using technologies that include Java frameworks (Seam, JSF, EJB3, Hibernate, Spring, Struts), testing frameworks (JUnit, TestNG), JavaScript and DOM scripting, CSS and page layouts, Maven 2, Ant, Groovy, and many others.After graduating from Cornell University with a degree in Materials Science and Engineering in 2000, Dan became captivated by the world of free and open source software, which gave him his debut in software development. He soon discovered the combination of Linux and the Java EE platform to be the ideal blend on which to build his professional career, with his interests equally divided between the two platforms.Dan is also a dedicated open source advocate, a committer on the Seam project, an active participant in the Seam community, and a Java blogger. You can keep up with Dan's development experiences by subscribing to his blog at http://mojavelinux.com."}, {"speakerName": "Peter Muir", "speakerbio": "Pete Muir is the project lead for Seam, and the Web Beans RI, and is a lead developer on RichFaces, a Rich Ajax JSF component set. Pete also represents JBoss on the JSF 2.0 Expert Group. Pete is currently employed by JBoss, a division of Red Hat, as a core developer working on JBoss open source projects. Before working for Red Hat, Pete used and contributed to Seam whilst working for a UK based staffing agency as IT Development Manager. Pete blogs about Seam, Web Beans and Java at http://in.relation.to/Bloggers/Pete"}, {"speakerName": "Andy Schwartz", "speakerbio": "Andy Schwartz is a software engineer at Oracle, where he has spent the last 16 years designing and developing user interface frameworks. Andy is currently one of the architects of ADF Faces, a JSF-based, AJAX-enabled framework and component set. Andy also serves as Oracle's representative to the JSR-314 (JSF 2.0) expert group.Andy blogs about JSF and ADF Faces at http://andyschwartz.wordpress.com/."}, {"speakerName": "Sang Shin", "speakerbio": "Sang Shin is presently working for Sun Microsystems as a Technology architect, consultant, and evangelist. He speaks on various Java and Solaris related technologies to worldwide developer audience. He is currently based in Boston area and his duties include evangelizing and consulting on important Java technologies such as Java EE (formerly J2EE), Java SE (formerly J2SE), Java ME (formerly J2ME), Web-tier frameworks and technologies such as JavaServer Faces (JSF), Struts and AJAX, and SOA and Web services technologies. He also speaks frequently on NetBeans IDE and platform. He frequently talks on these topics in various technical conferences.Sang Shin has been with Sun Microsystems for many years working in various research and engineering projects mostly in data communication, networking, internet, and Java related areas. Prior to Sun, he worked in several startup companies in various engineering and managerial capacities. Whenever he finds time, he also teaches several software engineering courses (\"Distributed programming using Jini networking technology\" , \"Web Services programming using XML and Java programming language\", \"XML\" ) in Brandeis university in Massachusetts. He currently teaches free online \"J2EE programming with Passion!\" and free online \"Ajax programming with Passion!\" courses. He is also co-author of Advanced Computer published by University of Maryland in 2005."}, {"speakerName": "Chet Haase", "speakerbio": "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java."}, {"speakerName": "Dan Haywood", "speakerbio": "Dan Haywood has 20 years' experience as a consultant, writer, and trainer, offering advice on domain-driven design and agile development practices for both the Java and .NET platforms. He has been working with Naked Objects since 2002 and is a committer to the Naked Objects framework; he is also the lead of a number of sister open source projects. He has also recently completed a book on the topic, \"Domain Driven Design using Naked Objects\"."}, {"speakerName": "Oliver Gierke", "speakerbio": "Oliver Gierke is Software Architect at Synyx GmbH & Co. KG located in Karsruhe, Germany. The company focuses on using and developing OpenSource software to provide consulting services and custom development to customers.\nOliver has been into JavaEE development since 2004 and focuses on architecture management, developer productivity and agile methods. He ocassionally writes for German JavaMagazin, speaks at technical events and is project lead of the Hades OpenSource project."}, {"speakerName": "Jaroslaw Jantura", "speakerbio": "Jaroslaw Jantura is Senior Software Engineer at NASK, Research and Academic Computer Network. He graduated with a master degree in Computer Science from Kielce University of Technology. After two years as a lecturer, he moved to the industry, first starting with C, C++, Objective-C, and then moving to Java. At NASK he specializes at security and large-scale computing including virtualization techniques, grids, and general-purpose computation on graphics hardware."}, {"speakerName": "Patrycja Wegrzynowicz", "speakerbio": "Patrycja Wegrzynowicz is the Head of Software R&D Department at NASK, Research and Academic Computer Network. At NASK she shapes the future direction of technological research in software as well as acts as a chief architect and consultant on the projects from the field of Internet domain names and DNS, Internet security, and large-scale digital archives together with semantic search. Patrycja holds a master degree in Computer Science and is currently finalizing her PhD at Warsaw University. Her academic interests are focused on language semantics and automated software engineering, particularly on static and dynamic analysis techniques to support program validation, verification, and comprehension."}, {"speakerName": "Christophe Coenraets", "speakerbio": "Christophe Coenraets is a technical evangelist for Adobe where he focuses on rich Internet applications and enterprise integration. He has been working on Flex since the early days of the product in 2003. In his previous role at Macromedia, Christophe worked on JRun, the company's J2EE application server. Before joining Macromedia, Christophe was managing Java and Internet applications evangelism at Sybase. Christophe has been a regular speaker at conferences worldwide for the last 15 years. He blogs at http://coenraets.org. "}, {"speakerName": "Noora Peura", "speakerbio": ""}, {"speakerName": "Anders Astrand", "speakerbio": ""}, {"speakerName": "Evert Arckens", "speakerbio": "Evert Arckens is working as a software architect at Outerthought. Outerthought has been building the open source CMS Daisy and is currently investigating highly scalable stores as the foundation of the next-generation version of their CMS offering. Prior to joining Outerthought, Evert gained years of experience in content addressed storage (CAS) while working on the Centera product family at EMC's R&D department and has been using Java in numerous projects."}, {"speakerName": "Steven Noels", "speakerbio": "Steven Noels is co-founder and CEO of Outerthought. Outerthought has been on the forefront of open source Java development for almost 8 years now, resulting in a successful content management product Daisy and an accompanying service delivery organization, as well as our own REST-centric web application framework Kauri. Daisy is in use at large and small organizations around the globe. Outerthought is all about internet software engineering, REST, Java and open source."}, {"speakerName": "Peter Niederwieser", "speakerbio": "Peter Niederwieser is a software developer from Linz, Austria. Over the past several years, he has worked on different projects in the Java Enterprise space. In his spare time, he enjoys hacking Groovy and Scala, traveling the world and playing chess. Peter is a Groovy committer and creator of the Spock framework."}, {"speakerName": "Geoffrey De Smet", "speakerbio": "Geoffrey De Smet is a member of the Drools team and the Drools Solver lead developer. He has years of experience with many Java technologies such as JPA, Spring, JEE, ..."}, {"speakerName": "Roger Kitain", "speakerbio": "Roger Kitain is a specification lead for JSF 2.0 (JSR 314). He has been involved with JSF since its inception and has been involved in the web technology space since 1997."}, {"speakerName": "Kees Jan Koster", "speakerbio": "Kees Jan Koster is a freelance Java architect and technical project leader. He is currently starting up Java-monitor as a community service, and as a business."}, {"speakerName": "Emmanuel Bernard", "speakerbio": "After graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry as developer and architect where he started to be involved in the ORM space. He joined the Hibernate team in 2003 and is now a lead developer at JBoss, a division of Red Hat. \nEmmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate Core implementing the Java Persistence(tm) specification. He also has founded and leads Hibernate Search and Hibernate Validator. Emmanuel is a member of the JPA 2.0 expert group and the spec lead of JSR 303: Bean Validation. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and Devoxx and the co-author of Hibernate Search in Action published by Manning."}, {"speakerName": "Antonio Goncalves", "speakerbio": "Antonio is a senior software architect specialized in Java/Java EE. As a consultant he advises customers in France and help them in defining their software architecture. Antonio is also the founder of the very successful Paris JUG and independent JCP member on JEE6 (JSR 316), JPA 2.0 (JSR 317) and EJB 3.1 (JSR 318). Based on all his experiences, he has written two books about Java EE 5 and recently on Java EE 6 with Glassfish. It explains, in a practical way, how to develop an application using most of the Java EE specifications.Related LinksAntonio's BlogParis JUG"}, {"speakerName": "Alexis Moussine-Pouchkine", "speakerbio": "Alexis Moussine-Pouchkine is a member of the GlassFish team and has been acting as the ambassador for the project for the past couple of years. He has has been working at Sun Microsystems for over 10 years and is a regular speaker at development and JUG conferences such as Devoxx, CommunityOne, or JavaZone. He also spends quality time with customers, developers, and architects to better drive the evolution of Sun's middleware technologies. Alexis participates in various open source communities, translates Java & XML books into French, but also has a live outside of Java! \"Read his technical blog at http://blogs.sun.com/alexismp"}, {"speakerName": "Sam Brodkin", "speakerbio": "Sam Brodkin is an American freelance technologist living as a Dutch citizen in Rotterdam. He has lent his deep technical knowhow and contagious enthusiasm to loads of J2EE projects in the last 10 years. He is the founder of the Dutch Google Technology User Group and has been knighted as \"Sam-a-lot\" by the illustrious J-Knights JUG. Sam's professional career began at Sun Microsystems promoting server-side Java technologies. He went on to teach corporate Java training seminars for companies like Sun and Oracle. His current focus and expertise lies in cutting edge J2EE development with special attention to testability and beautiful coding. Sam has recently stuck his head in The Cloud and welcomes you to join him there."}, {"speakerName": "Scott Stevenson", "speakerbio": "Originally from Scotland, Scott Stevenson is a freelance software consultant based in Brussels. He has over 20 years experience in the IT industry as a project manager, developer and architect. Most recently he has specialised in Java Server Faces, RichFaces, Ajax and related technologies, implementing pragmatic solutions for several major clients in the Benelux. Scott is a member of the elite J-Knights JUG."}, {"speakerName": "Erik Hatcher", "speakerbio": "Erik Hatcher is an Apache Software Foundation member, and an active committer on the Lucene and Solr projects. Erik has co-authored the award-winning book Java Development with Ant (Manning) and the well reviewed Lucene in Action (Manning). Erik has spoken frequently at industry conferences, including JavaOne, ApacheCon, OSCON, and the No Fluff, Just Stuff symposium circuit. Erik co-founded and member of the technical staff of Lucid Imagination, a full service Lucene/Solr shop."}, {"speakerName": "Martijn Dashorst", "speakerbio": "Martijn Dashorst is a senior software engineer for Topicus B.V.. He is a committer on the Wicket project and works on many Wicket related projects. When he doesn't work with or on Wicket, he likes to spend time with his girlfriend and two cats."}, {"speakerName": "Stephen Chin", "speakerbio": "Open-source developer and agile manager, Stephen Chin is founder of numerous open-source projects including WidgetFX and JFXtras and Director of Software Engineering at Inovis in Emeryville, CA. He has been working with Java desktop and enterprise technologies for over a decade, and has a passion for improving development technologies and process. Stephen's interest in Java technologies has lead him to start a Java and JavaFX focused blog that is targeted at early technology adopters. He's also the co-author of the Pro JavaFX Platform book."}, {"speakerName": "Nicolai Josuttis", "speakerbio": "Nicolai Josuttis is an independent system architect, technical manager, author, and consultant. He designs mid-sized and large software systems for the telecommunication, traffic, finance, and manufacturing industries. He is well known both in the programming community and to attendees at various conferences because he not only speaks and writes with authority (being the (co-)author of the world-wide best-sellers The C++ Standard Library and C++ Templates) but is also an innovative presenter having talked at various conferences and events.\n\nBeing an expert of large distributed systems, during the past years he became an expert of SOA. As a team lead for the realization of a SOA landscape at an international mobile phone company, he knows the difference between theory and practice. Today this SOA landscape connects more than 30 distributed heterogeneous systems using over 300 services in production (each day millions of services are called). In addition, he consults different SOA projects in different countries and gives SOA tutorials both as public and in-house trainings. This book will contain the essence of all this experience.\n\nWith his partner, Jutta Eckstein, he founded IT-communication, knowing that the real reason for large project failure is miscommunication and not technology. With Jutta Eckstein, the world-wide expert of agile system development in large projects, and Nicolai Josuttis, you have a combination of two exceptional experts that help to bring technical aspects of large systems in sync with organizational contexts and processes so that critical IT projects become successful."}, {"speakerName": "Matt Casters", "speakerbio": "Matt Casters is founder and primary sponsor of the Kettle project and is responsible for leading the architecture and delivery of Pentaho's Data Integration solutions. Matt has more than 15 years experience in data warehousing and business intelligence. His background as a Unix support professional, a programmer, and a database consultant, combined with the business knowledge he gained from leading BI implementations lead him to the create the Kettle (now Pentaho Data Integration) software platform.\n\nMatt is 40 years old, married with 2 children and lives in Ninove/Belgium."}, {"speakerName": "Frederic Simon", "speakerbio": "Frederic's software development experience goes back to 1992. He has been a Java (SE and EE) architect and consultant since 1999.\nFounded AlphaCSP (pure Java consulting firm) in 1998. In 2008, Frederic founded JFrog Ltd. in which he acts as the Chief Architect.\nOver these years, Frederic led Java Server Side development projects in large scale European and Israeli organizations.\n\nOpen Source Activities Involvement and Projects\n- Artifactory, Maven Anno Mojo, Jade Plugins, Dependency Analyzer and Java Shell, fan4idea The realistic, sky rendering stellarium4Java.sourceforge.net\n- Java 7 playground project kijaro.dev.java.net ,where he implemented the \"abstract enum\" language change"}, {"speakerName": "Yoav Landman", "speakerbio": "Yoav is a Java professional with over 10 years of hands-on experience. Founded JFrog Ltd., in which he acts as the development lead.\nYoav acted as a Java Consultant at AlphaCSP (a pure Java consulting firm) for over eight years. He managed and expedited large-scale Java-based projects with clients, ranging from start-ups to Fortune 500 companies.\nBefore that, Yoav held various technical lead and management positions in Versata Inc. (Australia), SMS Consulting (Australia), and Attunity Ltd. (Israel).\n\nOpen Source Activities Involvement and Projects\n- Started Artifactory OS project in late 2006\n- Worked on development-supporting OS projects such as Maven Anno Mojo (common annotation-based Maven plug-ins framework, used by projects like JAXB), Jade plug-ins, and Dependency Analyzer"}, {"speakerName": "Hans Dockter", "speakerbio": "Hans Dockter is the founder and project lead of Gradle and the CEO of Gradle Inc.. He works also as a trainer for Skills Matter, a UK based training company. Hans teaches Patterns, TDD and Domain Driven Design. In the past years he has worked as a Senior Developer for Krugle and Volkswagen. In the early days he was also a committer for the JBoss project and founded the JBoss-IDE."}, {"speakerName": "Hildeberto Mendonça", "speakerbio": "Hildeberto Mendonça is a PhD researcher at the Louvain Polytechnic School of Université catholique de Louvain (Belgium) where he works with Multimodal User Interaction. He has a bachelor's degree in Computer Science at University of Fortaleza, Brazil. During his undergraduate studies he worked in the Laboratory of Human Computer Interaction with distance learning and digital TV projects. Afterwards, he worked in the Laboratory of Knowledge Management with public security and knowledge bases projects. He has finished his Diploma of Extended Studies in Human Computer Interaction Meta Representation. He has a rich professional experience in web application development, collaborative systems, and software engineering and software architecture projects. His technical skills are in the Java platform and its main extensions, C++, XML, relational databases, distributed systems, web services, web and desktop user interfaces, and creation and maintenance of knowledge bases."}, {"speakerName": "Kenia Sousa", "speakerbio": "Kenia Sousa is a PhD researcher at the Louvain School of Management of Université catholique de Louvain (Belgium) where she works in the Belgian Laboratory of Computer-Human Interaction (BCHI) with Human-Computer Interaction (HCI) and Business Process Management. She has her Masters degree from University of Fortaleza, Brazil, during this time she was the Vice-Chair of the ACM SIGCHI Brazilian Organizing Committee. In the industry, she has provided consulting services for software organizations on the definition of the software development process. Currently, she is member of the ACM SIGCHI Belgian Chapter and member of the UsiXML Consortium."}, {"speakerName": "Frank Sommers", "speakerbio": "Editor-in-Chief of Artima. Co-author (with Philipp Haller) of \"Actors in Scala\""}, {"speakerName": "Anton Epple", "speakerbio": "Anton Epple is a trainer and consultant at Eppleton IT Consulting in Munich Germay with more than 8 years experience in leading Java projects. My main focus is on the NetBeans Platform, which has created a lot of buzz at this years J1 with the US Army presenting the Platform as enabling technology and NDSatCom showing their Duke's Choice Award winning massive NB Platform Application in James Goslings tyoshow Keynote. My current project is helping to make OSGi fully interoperable with the platform.\n\nAs my contribution to the Java Community and Open Source technologies I'm Community Leader for the JavaTools Community at java.net, JUG Leader for the NetBeans User Group Munich and a member of the NetBeans Dream Team. I'm doing a lot of trainings including free trainings for the NetBeans Platform Certified course at various european universities:\n- http://blogs.sun.com/geertjan/entry/warsaw_on_the_netbeans_platform\n- http://blogs.sun.com/johnc/entry/netbeans_platform_training_taking_off\n- http://ssw.jku.at/Teaching/Lectures/SpezialLVA/TulachWielenga/"}, {"speakerName": "Geertjan Wielenga", "speakerbio": "Geertjan Wielenga writes training & documentation for the NetBeans Platform. He is based in Prague, Czech Republic, where he's worked for Sun Microsystems for the past 5 years. He co-authored books about the NetBeans Platform and is also a DZone contributor."}, {"speakerName": "Vaclav Pech", "speakerbio": "Vaclav is a programming enthusiast who's constantly seeking ways to make development more effective and enjoyable. He's particularly interested in server-side Java technologies, distributed systems, parallel programming, agile methodologies, modern programming languages, DSLs and of course IntelliJ IDEA.\nHe works for JetBrains as a senior software developer and a product evangelist. On the side, he's building GParallelizer, an opensource concurrency library, investigates the domains of neural networks, evolutionary programming and data mining."}, {"speakerName": "Frederic Marius", "speakerbio": "Frederic Marius is Java Architect at Smals and he has been working with Java for more than 10 years.\nIn the last few years he has been a member of the Java Development Standardization team of the company, and it's in that context that an integrated development environment has been set up using open source tools. Frederic also likes to give Java related trainings to colleagues at Smals."}, {"speakerName": "Antonio Goncalves", "speakerbio": "Antonio is a senior software architect specialized in Java/Java EE. As a consultant he advises customers in France and help them in defining their software architecture. Antonio is also the founder of the very successful Paris JUG and independent JCP member on JEE6 (JSR 316), JPA 2.0 (JSR 317) and EJB 3.1 (JSR 318). Based on all his experiences, he has written two books about Java EE 5 and recently on Java EE 6 with Glassfish. It explains, in a practical way, how to develop an application using most of the Java EE specifications."}, {"speakerName": "Alexis Moussine-Pouchkine", "speakerbio": "Alexis Moussine-Pouchkine is a member of the GlassFish team and has been acting as the ambassador for the project for the past couple of years. He has has been working at Sun Microsystems for over 10 years and is a regular speaker at development and JUG conferences such as Devoxx, CommunityOne, or JavaZone. He also spends quality time with customers, developers, and architects to better drive the evolution of Sun's middleware technologies. Alexis participates in various open source communities, translates Java & XML books into French, but also has a live outside of Java! \nRead his technical blog at http://blogs.sun.com/alexismp"}, {"speakerName": "Roberto Chinnici", "speakerbio": "Roberto Chinnici is a senior staff engineer at Sun Microsystems, Inc. and the specification lead for the Java Platform Enterprise Edition 6. Previously he was the specification lead for JAX-WS 2.0 and JAX-RPC 1.1 and an active participant in W3C and WS-I working groups."}, {"speakerName": "Paul Sandoz", "speakerbio": "Paul Sandoz is the co-spec lead for JSR 311: JAX-RS: The Java API for RESTful Web Services and the implementation lead for the production quality reference implementation, Jersey. When the mood of verbosity arises Paul blogs on JAX-RS/Jersey"}, {"speakerName": "Sebastian Hennebrueder", "speakerbio": "Sebastian Hennebrueder is a freelancer working as software developer and trainer. He offers training for Hibernate and Java Persistence, published a book on Hibernate and is doing a lot of research on web frameworks and web technologies. You can find his articles on http://www.laliluna.de \nApart from doing trainings in Europe, he works as normal software developer and team coach for other companies."}, {"speakerName": "Lieven Doclo", "speakerbio": "Lieven Doclo has been the project lead for Spring RCP since October 2008. He has worked with the Spring Rich Client framework for more than 2 years now and has 4 years of active Java development on his resumé. He's currently a Java Consultant at Jintec, a consultancy agency specialized in Java development.\nJan Hoskens was the former project lead for Spring RCP and was responsible for building the front-end framework at a Belgian printing company. He's been active for more than 3 years in the RCP ecosphere, and has more than 7 years of Java development on his resumé. He's currently a Java Consultant and Jintec, a consultancy agency specialized in Java development."}, {"speakerName": "Nicolas Leroux", "speakerbio": "Nicolas started young in computing, and joined Lunatech Research in 2000 after having completed his computer science studies in Nice, France, while continuing studying at NEWI University of Wales. After two years in Wales, he returned to Holland, where he has since acquired experience working on projects for many different customers. Nicolas is an expert early adopter of the Java Enterprise platform as well as the open-source technologies that gravitate around it."}, {"speakerName": "Filippo Diotalevi", "speakerbio": "Filippo Diotalevi, OSGi consultant and Apache Felix committer"}, {"speakerName": "Tom Mahieu", "speakerbio": "Tom Mahieu is a software engineer at PeopleWare with a combined interest in Web 2.0 application development and communication middleware. He received a PhD in Computer Science from the Katholieke Universiteit Leuven, where his research was mainly focussed on distributed computer systems and computer networks, such as end-to-end network mobility solutions and the development of dynamically (re-)configurable protocol stacks. Additionally he contributed to a number of related research projects such as the design of Quality-of-Service-aware communication middleware and the development of a service platform for the publication of electronic newspapers."}, {"speakerName": "Peter Lubbers", "speakerbio": "Peter Lubbers is the director of documentation and training at Kaazing. He is the co-author of the upcoming Apress book Pro HTML5 Programming and teaches a three-day HTML5 training course for Skills Matter. Prior to joining Kaazing, Peter worked as an information architect at Oracle, where he wrote many books, such as the award-winning Oracle Application Server Portal Configuration Guide. Peter also develops documentation automation solutions and two of his inventions are patented."}, {"speakerName": "Antonio Marin Neto", "speakerbio": "Antonio Marin Neto works with JAVA development since 2002 (and with Java ME since 2005) and already presented his works in different sort of events."}, {"speakerName": "Ludovic Champenois", "speakerbio": ""}, {"speakerName": "Mark Reinhold", "speakerbio": "Mark Reinhold is a Principal Engineer at Sun Microsystems, where he works on the Java Platform, Standard Edition, and the OpenJDK Project. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. Mark was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6. He is currently leading the Jigsaw and JDK 7 Projects in the OpenJDK Community. Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology."}, {"speakerName": "Nicolai Josuttis", "speakerbio": "Nicolai Josuttis is an independent system architect, technical manager, author, and consultant. He designs mid-sized and large software systems for the telecommunication, traffic, finance, and manufacturing industries. He is well known both in the programming community and to attendees at various conferences because he not only speaks and writes with authority (being the (co-)author of the world-wide best-sellers The C++ Standard Library and C++ Templates) but is also an innovative presenter having talked at various conferences and events.Being an expert of large distributed systems, during the past years he became an expert of SOA. As a team lead for the realization of a SOA landscape at an international mobile phone company, he knows the difference between theory and practice. Today this SOA landscape connects more than 30 distributed heterogeneous systems using over 300 services in production (each day millions of services are called). In addition, he consults different SOA projects in different countries and gives SOA tutorials both as public and in-house trainings. This book will contain the essence of all this experience.With his partner, Jutta Eckstein, he founded IT-communication, knowing that the real reason for large project failure is miscommunication and not technology. With Jutta Eckstein, the world-wide expert of agile system development in large projects, and Nicolai Josuttis, you have a combination of two exceptional experts that help to bring technical aspects of large systems in sync with organizational contexts and processes so that critical IT projects become successful."}, {"speakerName": "Eric Steegmans", "speakerbio": "Eric Steegmans is a professor at the department of computer science of the K.U.Leuven. After a decade of research in compiler construction, he directed his research activities to the area of software engineering. Since the early nineties, his expertise is in object-oriented analysis, design and implementation. He is leading a small research group that experiments with new language concepts at different levels of abstraction. Since a few years, he is program director for the bachelor-master in informatics. He teaches basic courses on object-oriented programming in the bachelor informatics and the bachelor computer science. In the master programs, he is in charge of courses on object-oriented programming languages and on object-oriented analysis."}, {"speakerName": "Scott Ambler", "speakerbio": ""}, {"speakerName": "Howard Lewis Ship", "speakerbio": "Howard Lewis Ship is the creator and lead developer for the Apache Tapestry project, and the creator of the Apache HiveMind project. He has over nineteen years of full-time software development under his belt, with over ten years of Java. He cut his teeth writing customer support software for Stratus Computer, but eventually traded PL/1 for Objective-C and NeXTSTEP before settling into Java. Lately, he's been dipping his toes into alternate languages, including Clojure.Howard is the author of Tapestry in Action for Manning Publications (which covers Tapestry 3.0), and is currently the Director of Open Source Technology for Formos Software Development. He lives in Portland, Oregon with his wife Suzanne, a novelist.Howard is writing lots of documentation lately, while gearing up for Tapestry 5.2. "}, {"speakerName": "Chris Richardson", "speakerbio": "Chris Richardson is a developer and architect with over 20 years of experience. He is a Java Champion and the author of POJOs in Action, which describes how to build enterprise Java applications with POJOs and lightweight frameworks such as Spring and Hibernate. Chris is the founder of CloudFoundry.com and the Head of Cloud Computing at SpringSource, a division of VMware. He lives in Oakland, CA with his wife and three children."}, {"speakerName": "Brian Goetz", "speakerbio": "Brian Goetz has been a professional software developer for more than twenty years. Brian is the author of the very successful 'Java Concurrency in Practice', and has written over 75 articles on Java development. He is one of the primary members of the Java Community Process JSR 166 Expert Group (Concurrency Utilities), and has served on numerous other JCP Expert Groups. Brian is a Sr. Staff Engineer at Sun Microsystems."}, {"speakerName": "Frank Greco", "speakerbio": "Frank D. Greco is the founder of the New York Java Special Interest Group (NYJavaSIG), one of the largest Java Users Groups (JUGs) on the planet with almost 5,000 active members in the local Java community. The NYJavaSIG has had some of the most famous Java luminaries speak at their meetings; including Java Champions: Rod Johnson, Brian Goetz, Doug Lea and Josh Bloch. Their members are very enthusiastic and, like most New Yorkers, don't hesitate to ask tough questions of their monthly speakers. Frank has a long history as a \"Champion\" of the Java Platform; he taught a developer track session at the very first Java Day back in September 1995 in New York and started the NYJavaSIG that afternoon. Frank has been involved with software development for over 10 years and has worked on sophisticated architectures, innovative user interfaces, mobile computing and next-generation collaborative financial systems. Frank is both a Java community leader as well as a luminary technologist working for Kaazing."}, {"speakerName": "Ceki Gülcü", "speakerbio": "Ceki Gülcü is the founder of several Open Source projects, including log4j, SLF4J and logback. His interests include software testing, security and reliability. He works as a software engineer at QOS.ch, a software development outfit located in Lausanne, Switzerland."}, {"speakerName": "Antonio Goncalves", "speakerbio": "Antonio is a senior software architect specialized in Java/Java EE. As a consultant he advises customers in France and help them in defining their software architecture. Antonio is also the founder of the very successful Paris JUG and independent JCP member on JEE6 (JSR 316), JPA 2.0 (JSR 317) and EJB 3.1 (JSR 318). Based on all his experiences, he has written two books about Java EE 5 and recently on Java EE 6 with Glassfish. It explains, in a practical way, how to develop an application using most of the Java EE specifications.Related LinksAntonio's BlogParis JUG"}, {"speakerName": "Tom Baeyens", "speakerbio": "Tom Baeyens is the founder and lead developer of JBoss jBPM, an open source workflow, BPM and orchestration engine. He is an employee of Red Hat and participates in the Java Community Process."}, {"speakerName": "Maarten Cox", "speakerbio": "Maarten Cox (born, raised and living in Belgium) is a Flash Platform Consultant and Adobe Certified Flex with AIR Instructor working at iDA MediaFoundry. Particularly interested in the UI of applications, he's focussing on UCD (User Centered Design) and the whole user experience in general. Flash Catalyst and Flex are his weapons of choice. "}, {"speakerName": "Serge Jespers", "speakerbio": "Serge Jespers (born, raised and living in Belgium) has been working with Flash for over 10 years now. 5 of which he worked for the largest media company in Belgium doing award-winning online projects for TV-shows like Idols, Big Brother, Miss Belgium, and more. Since early 2004 he's been an Adobe certified freelance Flash designer/developer. He's one of those guys who thinks you can do anything with Flash. From displaying SMS-messages on TV to motion tracking museum installations to mobile live traffic updates to personalized Flash video projects. Serge joined Adobe in March 2007 and moved to the platform evangelism team in November of that year. He is now spreading the word about AIR, Flash and Flex all over Europe, Middle East and Africa (EMEA)"}, {"speakerName": "Cameron Purdy", "speakerbio": "Cameron Purdy is Vice President of Development at Oracle. Prior to joining Oracle, Mr. Purdy was the CEO of Tangosol, whose revolutionary Coherence Data Grid product provides reliable and scalable data management across the enterprise. Mr. Purdy has over ten years of experience with Java and Java-related technology. As a software visionary and industry leader, Mr. Purdy is a frequent presenter at industry conferences and has received a number of awards in recognition of his contribution to the Java community, including twice being named as a JavaOne RockStar and being recognized in TheServerSide's Who's Who in Enterprise Java. He regularly participates in industry standards development and is a specification lead for the Java Community Process."}, {"speakerName": "Richard Bair", "speakerbio": "Richard is a longtime speaker and member of the Swing Team at Sun Microsystems. He has his roots as an application developer turned toolkit developer and is the lead of the component toolkit API for JavaFX. He is a frequent presenter and teams up frequently with other UI luminaries to produce demos for JavaOne and other conferences. As an application developer he had a specific penchant for databases and multi-tier design."}, {"speakerName": "Jasper Potts", "speakerbio": "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration."}, {"speakerName": "Bill Venners", "speakerbio": "Bill Venners is president of Artima Software, Inc. and editor-in- chief of Artima Developer. He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platforms architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Bill has been active in the Jini Community since its inception. He led the Jini Community ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services."}, {"speakerName": "Jean-Francois Arcand", "speakerbio": "Jean-Francois Arcand works for Sun Microsystems. He currently leads project Grizzly, an extended NIO based framework used in multiples products. He also works on Web 2.0 topics like Ajax performance and leads the Comet activities at Sun. Jean-Francois lives and works from home in Prevost, a very small city in Québec where life is perfect. "}, {"speakerName": "Paul Sandoz", "speakerbio": "Paul Sandoz is the co-spec lead for JSR 311: JAX-RS: The Java API for RESTful Web Services and the implementation lead for the production quality reference implementation, Jersey. When the mood of verbosity arises Paul blogs on JAX-RS/JerseyRelated links JSR 311JerseyPaul Sandoz Blog"}, {"speakerName": "Christophe Herreman", "speakerbio": "Christophe Herreman is a Senior Flex Consultant at Boulevart (a Cronos company). He has been working with Flash technology for over a decade and has seen it become the leading platform for creating Rich Internet Applications. For the last years, he has worked on enterprise projects in Flex and has made several contributions to the open-source community. He is the founder and lead developer of Spring ActionScript, an offshoot of Java Spring, which is an ActionScript 3.0 framework and Inversion of Control container that can be used for Flex, Flash and AIR development."}, {"speakerName": "Doug Tidwell", "speakerbio": "Doug Tidwell is a Senior Software Engineer in IBM's Emerging Technology group. He was a speaker at the first XML conference in 1997, and has been working with markup languages, Web services and SOA technologies for many years. His job as a technology evangelist is to explain the standards and technologies behind Web 2.0 and to help customers integrate them into their overall business architectures and strategies. He is the author of many articles on IBM's developerWorks site (ibm.com/developerWorks), and is the author of O'Reilly's book on XSLT, the second edition of which is now available.He lives in Chapel Hill, North Carolina with his wife, daughter and Domino the Wonder Dog. "}, {"speakerName": "Joseph D. Darcy", "speakerbio": "Joe is currently the lead engineer of Project Coin, the effort to select and implement a set of small Java language changes for JDK 7. He also serves as a member of the JDK 7 release team. Concurrently, Joe continues to be the release manager, lead engineer, and quality lead for OpenJDK 6, an open source implementation of the Java SE 6 platform.A longtime member of the JDK engineering group, Joe was previously specification lead for JSR 269, the Pluggable Annotation Processing API, which delivered a standardized annotation processing API and mirror-based language model into JDK 6 to supersede the earlier apt tool from JDK 5. Joe assisted in implementing the JDK 5 language changes with work spanning core reflection, javac hacking, and general library support.Joe holds a master's degree in computer science from UC Berkeley and a master's degree in applied math from Stanford University."}, {"speakerName": "Gregor Hohpe", "speakerbio": "Gregor Hohpe is a software architect with Google, Inc. Gregor is a widely recognized thought leader on asynchronous messaging and service-oriented architectures. He co-authored the seminal book 'Enterprise Integration Patterns' (Addison-Wesley, 2004), followed by \"Integration Patterns\" and \"Enterprise Solution Patterns\", both published by Microsoft Press. He was nominated a Microsoft MVP (Most Valuable Professional) Solution Architect for his contributions to the developer community and recognized as an active member of the patterns community by the Hillside Group. In 2005, Joel Spolsky selected Gregor's article 'Starbucks Does Not Use Two-phase Commit' for his 'Best Software Writing' (APress). Gregor speaks regularly at technical conferences around the world. He likes to cut through the hype surrounding service-oriented architectures and captures nuggets of advice in the form of design patterns that can help developers avoid costly mistakes. Find out more about his work at eaipatterns.com"}, {"speakerName": "Timothy Perrett", "speakerbio": "Timothy Perrett is a UK based developer and architect currently working for a division of Xerox Corporation in Europe, Middle East and Africa. Having worked in and around manufacturing and workflow systems for nearly 7 years, he has wealth of experience building machine automation and writing system integration middleware. Tim is an active committer on the Scala \"Lift\" project and has been for the past two years and is responsible for Lift's various 3rd party integration modules and localization."}, {"speakerName": "Chet Haase", "speakerbio": "Chet Haase is a senior computer scientist on the Flex SDK team at Adobe, focusing on graphics issues and features. In a former life, he worked for Sun Microsystems as a client architect in the Desktop Java group, working with client technologies such as Java 2D, Swing, AWT, and deployment. He is coauthor with Romain Guy of the book Filthy Rich Clients: Developing Animated and Graphical Effects for Desktop Java Applications. He and Guy are presenting a session on filthy rich clients, beyond Java."}, {"speakerName": "Romain Guy", "speakerbio": "Romain has a long experience developing rich desktop user interfaces in Swing. He now works at Google on the Android mobile platform project, as a UI toolkit engineer. His other experiences include working in the Swing team at Sun Microsystems, publishing Filthy Rich Clients, a book on advanced Swing user interfaces, speaking at various conferences (JavaPolis, JavaOne, etc.), blogging extensively about Swing and Java 2D and working on various Open Source project (Android, SwingLabs, etc.)"}, {"speakerName": "Koen Van Exem", "speakerbio": "Koen is business manager at Inxin. He has more than 10 years of Agile Experience mentoring and coaching successful teams. In the nineties Inxin adopted FDD and later XP, SCRUM and DSDM. We developed the Dimensional Planning technique to improve the existing Agile methods. He is also active in the Agile Community and is a board member at the Agile Consortium Benelux. He is also business manager of Allors. He has over 25 years of experience in developing software and jumped from c++ to Java when the first beta came out. He started Allors in 2001 as an Open Source product company building a platform, (testing) tools and applications for the next generation Object and Relation Oriented development. He is the inventor of Multiple Type Declarations that bridge the gap between dynamic and static languages , it is a kind of type safe duck typing "}, {"speakerName": "Arjen Poutsma", "speakerbio": "Arjen Poutsma is a senior software engineer at SpringSource with fifteen years' experience in commercial software environments. During this time he has worked with both Java EE and Microsoft .NET. Three years ago, Arjen started to specialize in Web Services and Service Oriented Architectures. During this period, he has worked for some of the largest organizations in the world helping them better understand enterprise Java and how SOAs fit into their organizations. In part from his experiences with these organizations, Arjen founded the open source Spring Web Services project and continues to lead the technical direction and development as the project lead for Spring Web Services. This project aims at facilitating development of document-driven web services. Currently, Arjen is working on the REST support for Spring 3."}, {"speakerName": "Martijn Dashorst", "speakerbio": "Martijn Dashorst is a senior software engineer for Topicus B.V.. He is a committer on the Wicket project and works on many Wicket related projects. When he doesn't work with or on Wicket, he likes to spend time with his girlfriend and two cats."}, {"speakerName": "Michael Kay", "speakerbio": "Dr. Michael Kay is best known for his work on XML. Based in the UK, he is the editor of the XSLT specification and author of the definitive book on the language, and is also active on the standards group for XQuery and XML Schema. He is also the developer of the popular open-source Saxon software which implements these specifications. He gained a PhD from the University of Cambridge in 1975 for work on database technology, and has retained links with the academic world, currently holding the position of Visiting Research Fellow at the University of Reading."}, {"speakerName": "Manik Surtani", "speakerbio": "Manik Surtani is a core R&D engineer at JBoss, a division of Red Hat. He is the founder of the Infinispan project, which he currently leads, and also leads the JBoss Cache project. His interests lie in cloud and distributed computing, autonomous systems and highly available computing. He has a background in artificial intelligence and neural networks, a field he left behind when he moved from academic circles to the commercial world. Since then, he's been working with Java-related technologies, first for a start-up focusing on knowledge management and information exchange, and later for a large London-based consultancy as a tech lead focused on e-commerce applications on large Java EE and peer-to-peer technology. Surtani is a strong proponent of open source development methodologies, ethos, and collaborative processes, and has been involved in open source since his first forays into computing. "}, {"speakerName": "Christophe Coenraets", "speakerbio": "Christophe Coenraets is a technical evangelist for Adobe where he focuses on rich Internet applications and enterprise integration. He has been working on Flex since the early days of the product in 2003. In his previous role at Macromedia, Christophe worked on JRun, the company's J2EE application server. Before joining Macromedia, Christophe was managing Java and Internet applications evangelism at Sybase. Christophe has been a regular speaker at conferences worldwide for the last 15 years. He blogs at http://coenraets.org. "}, {"speakerName": "Stephen Chin", "speakerbio": "Open-source developer and agile manager, Stephen Chin is founder of numerous open-source projects including WidgetFX and JFXtras and Director of Software Engineering at Inovis in Emeryville, CA. He has been working with Java desktop and enterprise technologies for over a decade, and has a passion for improving development technologies and process. Stephen's interest in Java technologies has lead him to start a Java and JavaFX focused blog that is targeted at early technology adopters. He's also the co-author of the Pro JavaFX Platform book."}, {"speakerName": "Kirk Pepperdine", "speakerbio": "Kirk Pepperdine is the Chief Technical Officer at Kodewerk Ltd. and has been focused on Object technologies and performance tuning for the last 15 years. Kirk is a co-author of the book ANT Developers Handbook and editor at The Server Side."}, {"speakerName": "Dan Hardiker", "speakerbio": "Dan is a Chief Technical Architect and founding member of Adaptavist.com who deal with Confluence Customization, Hosting, Support and Bespoke development. He has many years of Java expertise, as well as almost 2 decades of experience with unix and networking systems. Dan has a background in event management and works with enabling geeks to socialize throughout the UK via the GeekUp.org initiative - a user group for techies of all skill sets."}, {"speakerName": "Kevin Nilson", "speakerbio": "Kevin Nilson is currently a Principal Software Architect for a Large Financial Firm in Silicon Valley. He is the co-lead of the Silicon Valley Web Developer JUG. He is also the co-lead of the Silicon Valley Google Technology User Group and Assistant Organizer of the Silicon Valley JavaScript Meetup. Prior to his current work, Kevin had extensive industry software engineering and consulting experience with companies such as: Pfizer, Northrop Grumman, and AT&T Corporation. He also worked part-time as an adjunct professor at the College of San Mateo. He is also a core contributer for confetto.org, a web based real-time open source conference collaboration tool used at conferences such as: Silicon Valley Code Camp and Devoxx. He is a Sun Certified Java Programmer and Sun Certified Web Component Developer.Co-lead Silicon Valley Web Developer Java User GroupCo-lead Silicon Valley Google Technology User GroupAssistant Organizer Silicon Valley JavaScript MeetupTaught 7 Courses College Of San MateoWinner of MySpace Editor's Choice Award for project YumieDate, at Open Social Weekend Apps hosted at GoogleCurrently Writing a book on Web 2.0Speaking at JavaOne, Community One, Tips and Trick on Running a User Group in Your Community"}, {"speakerName": "Matthew Eernisse", "speakerbio": "Matthew Eernisse is a Web developer working primarily with JavaScript, Ruby, and Python, and has been building interactive Web applications for over a decade. He is author of the SitePoint book, \"Build Your Own Ajax Web Applications.\" Matthew lives in San Francisco with his wife and three boys. Matthew plays the drums and speaks fluent Japanese. Matthew has a personal blog at http://fleegix.org/"}, {"speakerName": "Nordin Haouari", "speakerbio": "Nordin is a software developer for Cegeka. Graduated in 2001 at the Catholic University of Leuven, he started his career developing desktop applications using Swing. After some years of building web applications in both Java and Coldfusion, he gained a strong interest in rich internet applications and has been using Adobe Flex since version 2.0. He currently coordinates the Flex competence center at Cegeka."}, {"speakerName": "Patrick Chanezon", "speakerbio": "Patrick Chanezon manages the Client and Cloud Advocacy team at Google, making the web better as a development platform with open web standards, GWT, Google Appengine and a lot of coffee. He has been a Developer Advocate at Google since 2005, building and growing developer ecosystems for OpenSocial, Google Checkout and the AdWords API. Previously he has been working on portals, blogs and syndication feeds at Sun Microsystems, AOL and Netscape. He's the co-founder of the ROME java open source project and the OSSGTP (Open Source Get Together Paris) group. Patrick is french, so he takes long vacations in the summer and likes to drink red wine with baguette and stinky cheese while wearing a beret. Apart from programming and reading books and mangas, his main interest in life is spending time with his wife and 3 kids.View his blog"}, {"speakerName": "Guillaume Laforge", "speakerbio": "Guillaume Laforge is the project lead of Groovy, the highly popular and successful dynamic language for the JVM. He co-authored Manning's best seller \"Groovy in Action\" with Dierk Konig, and is working for SpringSource (a division of VMWare) where he's working full time on cool and Groovy stuff. Guillaume worked hand in hand with the Google App Engine Java team before the official launch of the new platform to ensure that Groovy would run well on this new cloud. With this background in mind, he created Gaelyk, a lightweight toolkit for developing applications written in Groovy on Google App Engine, that he demonstrated at the Google I/O 2009 Conference. ou can meet Guillaume at conferences around the world where he evangelizes the Groovy dynamic language, Domain-Specific Languages in Groovy, and the agile Grails web framework.GroovyGaelyk"}, {"speakerName": "Dick Wall", "speakerbio": "JavaPosse.com Member"}, {"speakerName": "Carl Quinn", "speakerbio": "JavaPosse.com Member"}, {"speakerName": "Tor Norbye", "speakerbio": "Tor Norbye is a principal engineer at Sun Microsystems, where he has worked on development tools since 1996, most recently on the Ruby and JavaScript editors in the NetBeans IDE. He is also a cohost of the weekly Java Posse podcast and specification lead for Java Specification Request (JSR) 273. As a JavaOne rock star, he lives the lifestyle by ending each and every programming session with a five-minute keyboard-smashing ceremony before storming offstage."}, {"speakerName": "Joe Nuxoll", "speakerbio": "JavaPosse.com Member "}, {"speakerName": "Mark Halvorson", "speakerbio": "Mark Halvorson is the \"Chief Imagineer\" and OpenSocial Evangelist at Atlassian Software - the makers of JIRA and Confluence. He has a long history working with portals and social enterprise software having worked in various capacities from software developer to technical marketer for Firepond, Plumtree, BEA and Oracle."}, {"speakerName": "Ross Mason", "speakerbio": "Ross Mason is Co-founder and CTO of MuleSource, Inc., the creators of the open source Mule integration platform. Prior he was CEO of SymphonySoft Limited, an EU-based company providing services for large-scale integration projects. Mason founded the Mule project in 2003. Mule is used by top-tier financial institutions as well as many other Fortune2000 enterprises. Previously, Mason was Lead Architect for RaboBank and played a key role in developing one of the first large-scale ESB implementations in 2001. Mason has also worked with NatWest Bank, Credit Suisse and UBS."}, {"speakerName": "Maiko Rocha", "speakerbio": "Maiko Rocha joined Oracle Corporation in 1995. He has more than fourteen years of both consulting and development experience on the Oracle product stack, ranging from the database to application server to development tools. Currently working as a Consulting Solutions Architect, he is contributing as one of the architecture advisors for both Fusion Middleware and Fusion Applications."}, {"speakerName": "George Maggessy", "speakerbio": "George Maggessy is a Principal Fusion Middleware Architect with more than twelve years of experience in consulting, software designing and development team leadership. George is currently helping Oracle development and customers around the world to implement the new Oracle's E2O Fusion Middleware Solution."}, {"speakerName": "Michael Ernst", "speakerbio": "Michael D. Ernst is an Associate Professor in the Computer Science and Engineering department at the University of Washington. Ernst's research aims to make software more reliable, more secure, and easier (and more fun!) to produce. His primary technical interests are in software engineering and related areas, including programming languages, type theory, security, program analysis, bug prediction, testing, and verification. Ernst's research combines strong theoretical foundations with realistic experimentation, with an eye to changing the way that software developers work. Dr. Ernst was previously a tenured professor at MIT, and before that a researcher at Microsoft Research."}, {"speakerName": "Roger Kitain", "speakerbio": "Roger Kitain is a specification lead for JSF 2.0 (JSR 314). He has been involved with JSF since its inception and has been involved in the web technology space since 1997."}, {"speakerName": "Dick Wall", "speakerbio": "JavaPosse.com Member"}, {"speakerName": "Roberto Chinnici", "speakerbio": "Roberto Chinnici is a senior staff engineer at Sun Microsystems, Inc. and the specification lead for the Java Platform Enterprise Edition 6. Previously he was the specification lead for JAX-WS 2.0 and JAX-RPC 1.1 and an active participant in W3C and WS-I working groups."}, {"speakerName": "Ludovic Champenois", "speakerbio": "Ludovic Champenois is a Principal Engineer at Sun Microsystems, and has been with Sun and Java for the last 13 years. He is one of the technical leads and architect on the OSGi based GlassFish Java EE 6 Application Server and is responsible to ensure best in class developer experience for Java EE programmers with GlassFish, Â NetBeans and Eclipse. He was the architect for the Java EE tooling in NetBeans 4.1, 5.0 and 5.5. Ludovic is also heavily involved in leading Sun's open source initiative: Projects jMaki (Ajax Framework), Phobos (Server Side JavaScript), OpenSolaris web stack (Apache, MySQL, PHP)."}, {"speakerName": "Simon Ritter", "speakerbio": "Simon Ritter specializes in looking at emerging technologies including grid computing, RFID, wireless sensor networks, robotics and wearable computing. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon joined Sun in 1996 and started working with Java technology; he has spent time doing both Java development and consultancy."}, {"speakerName": "Mark Reinhold", "speakerbio": "Mark Reinhold is a Principal Engineer at Sun Microsystems, where he works on the Java Platform, Standard Edition, and the OpenJDK Project. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. Mark was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6. He is currently leading the Jigsaw and JDK 7 Projects in the OpenJDK Community. Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology."}, {"speakerName": "Holly Cummins", "speakerbio": "Holly is a performance tooling developer within the IBM Java Technology Centre. She leads development on IBM Monitoring and Diagnostic Tools for Javaâ¢ - Health Center and was the author of the GC and Memory Visualizer tool. Her tooling work builds on her experience working as a performance engineer within the garbage collection development team. Holly has been with IBM for seven years. Before joining IBM, she completed a doctorate in quantum computation at the University of Oxford. She has spoken at a variety of industry events including JavaZone, The ServerSide Java Symposium, The Great Indian Developer Summit, and WebSphere User Groups."}, {"speakerName": "Jason van Zyl", "speakerbio": "Jason is the founder of the Apache Maven project, the Plexus IoC framework, and the Apache Velocity project. Jason currently serves on the Apache Maven Project Management Committee. He has been involved with the Apache Software Foundation (ASF) for seven years, helped to found Codehaus, a well respected incubation facility for open source community projects, and is a frequent speaker at many major software conferences, including JavaOne, EclipseCon, EmergingTech, and ApacheCon.Jason van Zyl, CTO of Sonatype, has over ten years of enterprise software development experience. He founded Periapt, Inc., a company that provided software infrastructure development services to Fortune 500 companies such as Toyota Corp., Bank of America, and Coca-Cola Co. Previous to Periapt, he worked as a Technology Architect at Compusense, a world leader in sensory analysis and data research."}, {"speakerName": "Virgil Dodson", "speakerbio": "Virgil Dodson is a Developer Evangelist at Actuate Corporation (sponsor of the open source BIRT project) and blogger/forum moderator at the BIRT Exchange community site. Virgil has over 13 years experience as a software developer. For the past 6 years he has helped Java developers get started with Actuate's embedded reporting products. He holds a Bachelor of Science degree in Computer Information Systems from DeVry."}, {"speakerName": "Richard Bair", "speakerbio": "Richard is a longtime speaker and member of the Swing Team at Sun Microsystems. He has his roots as an application developer turned toolkit developer and is the lead of the component toolkit API for JavaFX. He is a frequent presenter and teams up frequently with other UI luminaries to produce demos for JavaOne and other conferences. As an application developer he had a specific penchant for databases and multi-tier design."}, {"speakerName": "Jasper Potts", "speakerbio": "Currently working as a engineer at Sun Microsystems on the Java Swing Team. There where I am working on JTable, Synth, Nimbus Look & Feel and various Java One talks. Prior to working at Sun I was working on a Java photo management application called Imagery for my own company Xerto. Imagery is a powerful piece of software for helping professionals manage large digital image collections. Built in Java with support for huge collections of hundreds of thousands of images and P2P server-less replicated collaboration."}, {"speakerName": "Simon Ritter", "speakerbio": "Simon Ritter specializes in looking at emerging technologies including grid computing, RFID, wireless sensor networks, robotics and wearable computing. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon joined Sun in 1996 and started working with Java technology; he has spent time doing both Java development and consultancy."}, {"speakerName": "Paul Brown", "speakerbio": "Dr. Paul C. Brown is a principal software architect at TIBCO Software Inc. and the author of Succeeding With SOA: Realizing Business Value Through Total Architecture and Implementing SOA: Total Architecture In Practice. His model-based tool architectures are the foundation of a diverse family of applications that design distributed control systems, process control interfaces, internal combustion engines, and NASA satellite missions. Dr. Brown's extensive design work on enterprise-scale information systems him to develop the total architecture concept: business processes and information systems are so intertwined that they must be architected together. Dr. Brown received his Ph.D. in Computer Science from Rensselaer Polytechnic Institute."}, {"speakerName": "Staffan Noteberg", "speakerbio": "Staffan Noteberg is a Java programmer, Agile coach, conference speaker and now also an author - as his book Pomodoro Technique Illustrated will soon be published by The Pragmatic Bookshelf. He lives in Stockholm, Sweden and Istanbul, Turkey. And he's not only focused on his own productivity; he's also passionate about helping all kind of office people to improve their personal time management."}, {"speakerName": "Brian Goetz", "speakerbio": "Brian Goetz has been a professional software developer for more than twenty years. Brian is the author of the very successful 'Java Concurrency in Practice', and has written over 75 articles on Java development. He is one of the primary members of the Java Community Process JSR 166 Expert Group (Concurrency Utilities), and has served on numerous other JCP Expert Groups. Brian is a Sr. Staff Engineer at Sun Microsystems."}, {"speakerName": "Alex Buckley", "speakerbio": "Alex Buckley is Computational Theologist at Sun Microsystems, responsible for the Java Language Specification and the Java VM Specification. He is currently spec lead for JSRs on modularity and annotations planned for Java SE 7. He has a PhD in Computer Science from Imperial College London."}, {"speakerName": "Andy Wilkinson", "speakerbio": "Andy Wilkinson is a senior software engineer at SpringSource with almost ten years' experience of developing and supporting enterprise Java middleware. Andy joined SpringSource in 2007 where he is a member of the SpringSource dm Server development team. Prior to joining SpringSource Andy worked at IBM, where he led the development of WebSphere Application Server's transaction manager."}, {"speakerName": "Simon Ritter", "speakerbio": "Simon Ritter specializes in looking at emerging technologies including grid computing, RFID, wireless sensor networks, robotics and wearable computing. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon joined Sun in 1996 and started working with Java technology; he has spent time doing both Java development and consultancy."}, {"speakerName": "Howard Lewis Ship", "speakerbio": "Howard Lewis Ship is the creator and lead developer for the Apache Tapestry project, and the creator of the Apache HiveMind project. He has over nineteen years of full-time software development under his belt, with over ten years of Java. He cut his teeth writing customer support software for Stratus Computer, but eventually traded PL/1 for Objective-C and NeXTSTEP before settling into Java. Lately, he's been dipping his toes into alternate languages, including Clojure.Howard is the author of Tapestry in Action for Manning Publications (which covers Tapestry 3.0), and is currently the Director of Open Source Technology for Formos Software Development. He lives in Portland, Oregon with his wife Suzanne, a novelist.Howard is writing lots of documentation lately, while gearing up for Tapestry 5.2. "}, {"speakerName": "Don Brown", "speakerbio": "Don is an Integration Architect at Atlassian in Sydney, Australia, with a background in the commercial and US Department of Defense sectors. He is a member of the Apache Software Foundation, and actively involved in several Apache projects starting with Struts in 2003. He has co-authored the book, Struts 2 in Action by Manning Publications, and occasionally speaks at Java and Open Source conferences including JavaOne, ApacheCon, TheServerSide Java Symposium, and local Java user groups."}, {"speakerName": "Remco Blom", "speakerbio": "Remco Blom is an Enterprise Architecture consultant and one of the EA practice leaders within BiZZdesign. He actively contributes to the development of the software tools, training and consultancy propositions of BiZZdesign. As an EA consultant, Remco helps organizations across the globe in a range of industries like finance, government, education, construction etc. Remco works with different methods and has specific expertise in TOGAF and ArchiMate. He studied Business Administration and Organizational Design at Radboud University Nijmegen, The Netherlands.Remco regularly provides (guest)lectures on Architecture at various institutes for higher education and is (co)writer of a book on EA methods, various courses and articles. He also speaks at conferences and seminars."}, {"speakerName": "Roel Spilker", "speakerbio": "Roel Spilker is a technology evangelist at TOPdesk. He's been a professional java programmer and teacher since 1999. Roel has been a fan of compile-time checking. His first open source project to leverage the compiler was the SPI project which simplifies the usage of the Service Provider API. Together with Reinier Zwitserloot he is the inventor of Project Lombok, a compiler/IDE plugin to bring the java programming language into the next decennium."}, {"speakerName": "Reinier Zwitserloot", "speakerbio": "Reinier Zwitserloot is the founder and lead developer of Tipit.to, a web service that enables tipjars on the web. He's been interested in programming language evolution ever since he started working with Java professionally 10 years ago. As a result, together with Roel Spilker he is the inventor of Project Lombok, a compiler/IDE plugin to bring the java programming language into the next decennium. "}, {"speakerName": "James Strachan", "speakerbio": "Technical Director at Progress Software working in the Open Source division (FUSE) Apache MemberProjects:ServiceMix - co-founder and active committerActiveMQ - PMC member and active committerCXF - Mentor and active committerCamel - active committer"}, {"speakerName": "Rob Davies", "speakerbio": "Director of Engineering at Progress Software working in the Open Source division (FUSE) Apache Member.Projects:ServiceMix - PMC member and active committerActiveMQ - active committerCamel - active committer"}, {"speakerName": "Toni Menzel", "speakerbio": "Toni Menzel is a 26-year-old independent software developer, architect and consultant.\n\nHis professional work is focused on Java, Java Enterprise and OSGi proven in airline businesses, healthcare industries and information technology corporates.\n\nToni is a passionate open source contributor to various projects including OPS4J, Apache Software Foundation and the eclipse foundation.\n\nTeam Lead of OPS4J Pax Exam and Commiter at Pax Construct and Pax Runner."}, {"speakerName": "Roman Strobl", "speakerbio": "Roman Strobl works at JetBrains as a technology evangelist. He has more than 12 years of software development experience in Java and various dynamic languages. Before joining JetBrains Roman worked at Sun Microsystems on the NetBeans and OpenSolaris projects. Roman is a frequent speaker at software conferences including Community One, Sun Tech Days, various Java events, and JUG meetings. Roman founded Czech Java User Group and enjoys supporting the Czech developer communtiy. Roman's current passion is evangelizing IntelliJ IDEA and exploring new languages which run on top of the JVM."}, {"speakerName": "Angelo van der Sijpt", "speakerbio": "Angelo van der Sijpt is a Java software engineer working for Luminis. His main expertise is in the field of OSGi, and he supports customers in setting up an agile work process for their software-intensive projects."}, {"speakerName": "Xander Tamminga", "speakerbio": "Xander Tamminga is a Software engineer working for Peek Traffic. His expertise is in the field of developing Java applications based on OSGi, developing C software for embedded systems and supporting the software development process by working as a Scrum Master."}, {"speakerName": "Peter Pilgrim", "speakerbio": "Peter Pilgrim's high-tech career began at the age of 12, where he learnt BASIC on a Research Machine 380Z school computer. He wrote games galore and taught himself how to program. Peter graduated from London South Bank University then went into IT industry. He started in Germany, then returned to the UK, and eventually found himself in Investment Banking. During this long and experienced career path he achieved a background with C/C++, Fortran 77 and Pascal programming languages.\n\nPeter is the founder and organised of the Java Web Users Group (JAVAWUG). In 2007, he was nominated by his fellow peers on the Sun Java Champions program. Peter is a Sun Certified Java Architect for the Java EE 5 platform. He has been writing Java programs since 1997. He has delivered talks on JavaFX for the JavaOne, Erlang Exchange, CommunityOne, San Francisco and QCon London. Peter writes the regular World View Series for the ACCU Magazine, CVu UK.\n\nPeter currently works full time for Lloyds Banking Group in the City of London, where he enjoys the role of Technical Leader for E-Business Services. He has been involved with Deutsche, UBS and Credit Suisse to name but a few."}, {"speakerName": "Robin Fernandes", "speakerbio": "Robin Fernandes joined IBM's Java Technology Centre in Hursley, United Kingdom as Software Developer in 2003. His current focus is a Java-based runtime for PHP, which is used in the CA1S SupportPac and WebSphere sMash. He also regularly contributes test cases and patches to php.net and enjoys experimenting with audio software in his spare time."}, {"speakerName": "Bill Venners", "speakerbio": "Bill Venners is president of Artima Software, Inc. and editor-in- chief of Artima Developer. He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platforms architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Bill has been active in the Jini Community since its inception. He led the Jini Community ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services."}, {"speakerName": "JUGs", "speakerbio": ""}, {"speakerName": "James Gosling", "speakerbio": "The father of Java"}, {"speakerName": "Dror Bereznitsky", "speakerbio": "Dror Bereznitsky is the director of technologies at AlphaCSP, the leading Java services company in Israel. He has more than ten years of experience in the IT industry and have been working for AlphaCSP since 2006. Prior to joining AlphaCSP he held various technical lead and management positions in the Israeli high-tech industry. In his current position he's responsible for leading the technological vision of the company. Dror is also an active member of the open source community leading and contributing to several projects such as fan4idea, Maven2 dependency analyzer and others."}, {"speakerName": "Fred Simon", "speakerbio": "Fred Simon is founder of AlphaCSP a pure Java service company in 1998, and founder of JFrog Ltd in 2008. His development experience goes back to 1992 around early Video encoding and server. He's a Java (SE and EE) architect and consultant since 1999."}, {"speakerName": "Mario Fusco", "speakerbio": "Mario is a Java programmer and architect with a more than decennial experience. He worked in Italy, Germany and currently in Switzerland being involved in (and often leading) many projects in different fields like advertising, e-commerce and insurance. His main interests about Java technologies are in multi-threaded programming and distributed computing, performance optimization, the most important enterprise level servers and frameworks, functional programming and the emerging Java compatible languages like Scala, Groovy or JRuby. Mario is also one of the leader of the Java User Group Lugano and the main developer of some open source projects like a a bidirectional XML to Java object converter called jamme and a library that allows to manipulate collections in a pseudo-functional and statically typed way known as lambdaj."}, {"speakerName": "Hubert Iwaniuk", "speakerbio": "Hubert Iwaniuk joined Grizzly Project in January 2009. Created Grizzly OSGi Http Service, contributes to Servlet/HTTP parts of Grizzly."}, {"speakerName": "Stephan Janssen", "speakerbio": "Stephan Janssen is a serial entrepreneur that has founded several successful organizations such as the Belgian Java User Group (BeJUG) in 1996, JCS Int. in 1998, JavaPolis in 2002 and recently Parleys.com in 2006.\n\nHe has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries. \n\nHe was selected by BEA Systems as the first European (independent) BEA Technical Director.\n\nHe has also been recognized by the Server Side as one of the 54 Who is Who in Enterprise Java 2004.\n\nSun has recognized in 2005 his efforts for the Java Community and has engaged me in the Java Champion project.\n\nHe has spoken at numerous Java and JUG conferences around the world."}, {"speakerName": "Matthew Eernisse", "speakerbio": "Matthew Eernisse is a Web developer working primarily with JavaScript, Ruby, and Python, and has been building interactive Web applications for over a decade. He is author of the SitePoint book, \"Build Your Own Ajax Web Applications.\" Matthew lives in San Francisco with his wife and three boys. Matthew plays the drums and speaks fluent Japanese. \n\nMatthew has a personal blog at http://fleegix.org/"}, {"speakerName": "Tareq Abedrabbo", "speakerbio": "I am a keen open source contributor, a committer on Spring Web Services and the co-author of the upcoming \"Spring in a Nutshell\" book (O'Reilly Media). I particularly enjoy reading and sharing my technical ramblings on my blog.\nMore recently, I've been involved with the Spring-WS Grails plugin and I'm working right now on the creation of a WS-Security module based on a simple and intuitive DSL and a convention-over-configuration approach.\nI work in the Telecom industry and I've been an enthusiastic adopter of Spring since 2004. My area of interests include web services and data integration."}, {"speakerName": "Zoe Slattery", "speakerbio": ""}, {"speakerName": "Daniel Gazineu", "speakerbio":"Daniel Gazineu has been working with JAVA in the last 6 years. During this time he already developed software for mobiles, servers and desktops. He's currently working at Nokia Institute of Technology, in Manaus, Brazil, building mobile health (mHealth) applications for resource poor populations."}] 